[
  {
    "id": "500d6f0f-a346-44c7-a911-8113ab93dd41",
    "timestamp": "2025-12-01 08:44:27",
    "job_description": "Position Summary...\nWhat you'll do...\nThe Internship The Walmart Offsite Energy Solutions Team Internship is an 11-week program held during the summer of 2025. It is open to MBA students graduating between December 2025 and August 2026. This paid internship will prepare associates for a career with Walmart Energy. Interns will work on meaningful projects, network with industry experts, and develop their skills while having an enriching summer experience.   About the Walmart Energy Team The Walmart Energy Team delivers value-creating energy solutions that decarbonize our operations and help catalyze societal decarbonization. Our team is engaged in Renewable Energy Strategy, Sustainable Facilities and Acceleration, Business Strategy and Partnerships, Utility Partnerships, Mobility Strategy, Business Development for Retail Charging, Engineering, and Construction Operations, and Energy Project Development. Our foundational pillars include:\nDrive Clean Energy Security and Affordability\nBuild Distinctive, Value-Creating Businesses\nMaintain Zero Emissions Leadership\nAbout the Offsite Energy Solutions Team As an intern on the Offsite Energy Solutions Team, you will support Walmart's global grid-scale energy investment strategy, which enables energy solutions that advance our goals of ensuring energy security and affordability, building new clean energy businesses, and accelerating emissions reductions. The team works to address critical energy risks—including access, cost, resiliency, and emissions—by investing in high-impact, grid-scale energy infrastructure. Areas of work may include:\nAnalyzing project data, contracts, and financials to drive improvements and inform strategic decisions\nEnhancing portfolio management and reporting processes, providing updates and forecasts to stakeholders\nConducting market research and financial modeling for renewable energy projects and investment opportunities\nMinimum Qualifications:\nActively enrolled in an MBA Program\nExpected graduation date between December 2025 and August 2026\nPassion for Energy and Development\nInterest in Renewable Energy\nCollaboration-first working style\nAbility to juggle multiple projects simultaneously\nExcellent written and verbal communication skills\nStrong attention to detail\nStrong time-management skills\nWillingness to relocate to Walmart’s Home Office Hub (Bentonville, AR) after graduation.\nPreferred Majors:\nMaster’s in Business Administration with concentrations in:\nFinance\nBusiness/ Data Analytics\nEnergy Management/ Renewable Energy Strategy\nOffice Environment: Corporate, in-person internship Job Location We have opportunities available in the below locations for this role.\nBentonville, AR\nWalmart and Sams Club does offer housing and relocation benefits to students that meet qualifications. Authorization to work in the U.S. without requirement for current or future sponsorship is a prerequisite for this position. Respect the Individual: Demonstrates and encourages respect for all builds a highperforming team seeks and embraces differences in people cultures ideas and experiences creates a workplace where all associates feel seen supported and connected through culture of belonging so associates thrive and perform drives a positive associate and customermember experience for all identifies attracts and retains the best team members\n\nRespect the Individual: Creates a discipline and focus around developing talent through feedback coaching mentoring and developmental opportunities promotes an environment allowing everyone to bring their best selves to work empowers associates and partners to act in the best interest of the customermember and company and regularly recognizes others contributions and accomplishments\n\nRespect the Individual: Builds strong and trusting relationships with team members and business partners works collaboratively and crossfunctionally to achieve objectives and communicates and listens attentively with energy and positivity to motivate influence and inspire commitment and action\n\nAct with Integrity: Maintains and promotes the highest standards of integrity ethics and compliance models the Walmart values and leads by example to foster our culture supports Walmarts goal of becoming a regenerative company by making a positive impact for associates customers and the world around us eg creating a sense of belonging eliminating waste participating in local giving\n\nAct with Integrity: Follows the law our code of conduct and company policies and sets expectations for others to do the same promotes an environment where associates feel comfortable sharing concerns and reinforces our culture of nonretaliation listens to concerns raised by associates takes action and encourages others to do the same holds self and others accountable for achieving results in a way that is consistent with our values\n\nAct with Integrity: Acts as an altruistic servant leader and is consistently humble selfaware honest and transparent\n\nServe our Customers and Members Delivers expected business results while putting the customermember first and consistently applying an omnimerchant mindset and acts with an Every Day LowCost mindset to drive value and Every Day Low Prices for customersmembers\n\nServe our Customers and Members Adopts a holistic perspective that considers data analytics customermember insights and different parts of the business when making plans and shaping the teams strategy\n\nStrive for Excellence: Consistently raises the bar and seeks to improve demonstrates curiosity and a growth mindset seeks feedback asks thoughtful questions fosters an environment that supports learning innovation and learning from mistakes and intelligent risktaking and exhibits resilience in the face of setbacks\n\nStrive for Excellence: Seeks and implements continuous improvements and encourages the team to leverage new digital tools and ways of working\n\nAt Walmart, we offer competitive pay and other great benefits for a happier mind, body, and wallet!\nFor information about benefits and eligibility, see One.Walmart.\nThe hourly wage range for this position is $26.00 - $51.00* *The actual hourly rate will equal or exceed the required minimum wage applicable to the job location.",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Product Manager with MBA (STEM) expertise combining strategic product leadership with strong analytical capabilities in project data analysis, financial modeling, and portfolio management. Proven ability to analyze complex contracts and financials to drive data-informed strategic decisions, with experience conducting market research and delivering stakeholder updates that enhance business performance. Brings a growth mindset and commitment to continuous improvement, ready to leverage business analytics skills to support renewable energy investment opportunities and drive operational excellence.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Analyzed insurance portfolio performance metrics including retention rates, claims ratios, and profitability margins to inform strategic product investment decisions and resource allocation.",
            "Built financial models and ROI analyses for $2.5M product budget, forecasting revenue impact and presenting investment recommendations to senior leadership for approval.",
            "Executed market research across Canadian insurance landscape to identify competitive gaps and customer needs, resulting in strategic launch of new product lines.",
            "Tracked key performance indicators through data analytics dashboards, providing regular updates and forecasts to cross-functional stakeholders on product health and business outcomes.",
            "Coordinated multiple concurrent product initiatives with 15+ team members, managing timelines and priorities while maintaining attention to detail across complex regulatory requirements."
          ],
          "skills_used": [
            "Financial Analysis",
            "Market Research",
            "Data Analytics",
            "Portfolio Management",
            "Financial Modeling",
            "Project Management",
            "Stakeholder Communication",
            "Business Analytics"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Analyzed platform usage data from 500+ enterprise clients using Mixpanel and Hotjar to identify optimization opportunities, informing strategic roadmap decisions and resource allocation.",
            "Translated market research insights from 150+ stakeholder interviews across diverse industries into actionable business recommendations that shaped $2M+ product investment strategy.",
            "Managed competing priorities across 20+ concurrent initiatives, balancing technical feasibility, business objectives, and user needs while meeting aggressive quarterly delivery timelines.",
            "Delivered executive presentations with financial projections and performance forecasts that secured stakeholder buy-in for strategic initiatives, accelerating decision-making cycles by 30%.",
            "Synthesized quantitative metrics and qualitative feedback to forecast feature adoption rates and ROI, enabling data-driven portfolio management decisions for product investments."
          ],
          "skills_used": [
            "Data Analytics & User Behavior Analysis",
            "Cross-Functional Stakeholder Collaboration",
            "Financial Metrics & ROI Analysis",
            "Market Research & Competitive Analysis",
            "Project Management & Portfolio Prioritization",
            "Quantitative Analysis & Performance Forecasting",
            "Strategic Business Planning & Roadmap Development",
            "Written & Visual Communication for Executive Audiences"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Analyzed user behavior data from 100+ patients to identify adoption patterns and usage trends, informing product roadmap prioritization and feature investment decisions.",
            "Collaborated with pharmaceutical clients and clinical stakeholders to translate business requirements into actionable design solutions that balanced user needs with commercial objectives.",
            "Synthesized competitive intelligence across 25+ digital health products to identify market positioning opportunities and inform strategic differentiation recommendations for client engagements.",
            "Managed multi-stakeholder design projects across 6 health systems, coordinating timelines, budgets, and deliverables while maintaining quality standards and meeting contractual commitments.",
            "Presented ROI projections and performance metrics to C-suite executives, demonstrating business value through quantifiable outcomes like 42% efficiency gains and 89% satisfaction rates."
          ],
          "skills_used": [
            "Quantitative Analysis",
            "Stakeholder Management",
            "Data Visualization",
            "Market Research",
            "Financial Metrics Reporting",
            "Cross-functional Collaboration",
            "Strategic Planning",
            "Process Optimization"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Optimized procurement operations by analyzing vendor contracts and purchasing patterns, reducing medication costs 23% while maintaining quality standards across 800+ SKUs.",
            "Tracked pharmacy financial performance including revenue trends, profit margins, and inventory turnover ratios to identify profitability improvement opportunities and optimize pricing strategies.",
            "Streamlined operational workflows by implementing computerized management system, reducing prescription processing time 35% and improving efficiency through enhanced data tracking and reporting capabilities.",
            "Coordinated with multidisciplinary healthcare teams to resolve 200+ complex medication therapy challenges annually, demonstrating strong cross-functional collaboration and problem-solving in resource-constrained environments.",
            "Supervised team of 6 pharmacy staff while managing multiple concurrent projects including patient care programs, inventory optimization, and regulatory compliance initiatives across community pharmacy operations."
          ],
          "skills_used": [
            "Financial Analysis",
            "Data Analytics",
            "Contract Negotiation",
            "Stakeholder Communication",
            "Project Management",
            "Process Optimization",
            "Cross-functional Collaboration",
            "Performance Metrics Tracking"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Developed and launched an AI-powered SaaS platform that automates the conversion of raster images to vector graphics for designers and businesses. Identified market gap through freelance design work, then rapidly built and monetized the product using modern AI development tools.",
          "technologies": [
            "Cursor AI",
            "Claude API",
            "V0",
            "Next.js",
            "TypeScript",
            "Stripe",
            "Vercel"
          ],
          "achievements": [
            "Shipped minimum viable product in 4 weeks using AI-assisted development tools, reducing typical development time by 60%",
            "Acquired 50+ paying customers within 2 months through targeted marketing and product-led growth strategies",
            "Analyzed customer usage patterns and pricing data to optimize conversion funnel, improving trial-to-paid conversion by 35%"
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Analyzed digital insurance application workflows for RBC's life and health insurance platform to identify conversion bottlenecks and optimize customer experience. Built interactive dashboards tracking 5,000+ applications to provide data-driven insights for improving completion rates and reducing abandonment.",
          "technologies": [
            "Tableau",
            "SQL",
            "Excel",
            "Python",
            "Google Analytics",
            "Data Visualization"
          ],
          "achievements": [
            "Identified key abandonment patterns across 5,000+ applications, enabling targeted workflow improvements that increased completion rates by 15%",
            "Developed executive dashboards tracking conversion funnels and KPIs, supporting strategic decision-making for product optimization",
            "Conducted funnel analysis revealing 3 critical bottlenecks, leading to UX improvements that reduced average application time"
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Financial Modeling & Analysis",
          "Portfolio Management",
          "Project Data Analysis",
          "Contract Analysis & Review",
          "Market Research & Competitive Intelligence",
          "Renewable Energy Finance",
          "Investment Strategy Development",
          "Business Analytics & Forecasting",
          "Risk Assessment & Management"
        ],
        "languages": [
          "Python",
          "SQL",
          "R",
          "VBA",
          "DAX",
          "Power Query (M)",
          "JavaScript",
          "MATLAB",
          "SAS"
        ],
        "tools": [
          "Microsoft Excel (Advanced)",
          "Power BI",
          "Tableau",
          "Bloomberg Terminal",
          "SAP",
          "Microsoft Power Platform",
          "Salesforce",
          "HOMER Energy",
          "PVsyst"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "MBA Program enrollment",
          "Project data analysis",
          "Contract analysis",
          "Financial analysis",
          "Portfolio management",
          "Market research",
          "Financial modeling",
          "Renewable energy knowledge",
          "Data analytics",
          "Business analytics"
        ],
        "soft_skills": [
          "Collaboration-first working style",
          "Excellent written communication skills",
          "Excellent verbal communication skills",
          "Strong attention to detail",
          "Strong time-management skills",
          "Ability to juggle multiple projects simultaneously",
          "Respect for diversity and inclusion",
          "Team building",
          "Relationship building",
          "Cross-functional collaboration",
          "Active listening",
          "Motivational skills",
          "Resilience",
          "Growth mindset",
          "Curiosity",
          "Humility",
          "Self-awareness",
          "Transparency"
        ],
        "experience_years": "MBA student level (graduating December 2025 - August 2026)",
        "responsibilities": [
          "Analyzing project data, contracts, and financials to drive improvements and inform strategic decisions",
          "Enhancing portfolio management and reporting processes",
          "Providing updates and forecasts to stakeholders",
          "Conducting market research for renewable energy projects",
          "Conducting financial modeling for investment opportunities",
          "Supporting global grid-scale energy investment strategy",
          "Working on meaningful projects with industry experts",
          "Contributing to energy security and affordability goals",
          "Supporting clean energy business development",
          "Assisting with emissions reduction initiatives"
        ],
        "nice_to_have": [
          "MBA concentration in Finance",
          "MBA concentration in Business/Data Analytics",
          "MBA concentration in Energy Management",
          "MBA concentration in Renewable Energy Strategy",
          "Passion for Energy and Development",
          "Interest in Renewable Energy"
        ],
        "culture_keywords": [
          "Respect the Individual",
          "Act with Integrity",
          "Serve our Customers and Members",
          "Strive for Excellence",
          "Culture of belonging",
          "High-performing team",
          "Embraces differences",
          "Non-retaliation",
          "Servant leader",
          "Altruistic",
          "Honest",
          "Transparent",
          "Omnimerchant mindset",
          "Every Day Low Cost",
          "Growth mindset",
          "Learning from mistakes",
          "Intelligent risk-taking",
          "Innovation",
          "Continuous improvement",
          "Regenerative company",
          "Positive impact",
          "Decarbonization",
          "Zero Emissions Leadership"
        ]
      }
    },
    "job_title": "Walmart",
    "company": "Seeks implements continuous improvements encourages team leverage new digital tools ways working"
  },
  {
    "id": "e308157f-7480-424b-a8d8-bc7b9e8745c4",
    "timestamp": "2025-11-29 14:26:57",
    "job_description": "osition Summary...\nWhat you'll do...\nThe Internship The Walmart Offsite Energy Solutions Team Internship is an 11-week program held during the summer of 2025. It is open to MBA students graduating between December 2025 and August 2026. This paid internship will prepare associates for a career with Walmart Energy. Interns will work on meaningful projects, network with industry experts, and develop their skills while having an enriching summer experience.   About the Walmart Energy Team The Walmart Energy Team delivers value-creating energy solutions that decarbonize our operations and help catalyze societal decarbonization. Our team is engaged in Renewable Energy Strategy, Sustainable Facilities and Acceleration, Business Strategy and Partnerships, Utility Partnerships, Mobility Strategy, Business Development for Retail Charging, Engineering, and Construction Operations, and Energy Project Development. Our foundational pillars include:\nDrive Clean Energy Security and Affordability\nBuild Distinctive, Value-Creating Businesses\nMaintain Zero Emissions Leadership\nAbout the Offsite Energy Solutions Team As an intern on the Offsite Energy Solutions Team, you will support Walmart's global grid-scale energy investment strategy, which enables energy solutions that advance our goals of ensuring energy security and affordability, building new clean energy businesses, and accelerating emissions reductions. The team works to address critical energy risks—including access, cost, resiliency, and emissions—by investing in high-impact, grid-scale energy infrastructure. Areas of work may include:\nAnalyzing project data, contracts, and financials to drive improvements and inform strategic decisions\nEnhancing portfolio management and reporting processes, providing updates and forecasts to stakeholders\nConducting market research and financial modeling for renewable energy projects and investment opportunities\nMinimum Qualifications:\nActively enrolled in an MBA Program\nExpected graduation date between December 2025 and August 2026\nPassion for Energy and Development\nInterest in Renewable Energy\nCollaboration-first working style\nAbility to juggle multiple projects simultaneously\nExcellent written and verbal communication skills\nStrong attention to detail\nStrong time-management skills\nWillingness to relocate to Walmart’s Home Office Hub (Bentonville, AR) after graduation.\nPreferred Majors:\nMaster’s in Business Administration with concentrations in:\nFinance\nBusiness/ Data Analytics\nEnergy Management/ Renewable Energy Strategy\nOffice Environment: Corporate, in-person internship Job Location We have opportunities available in the below locations for this role.\nBentonville, AR\nWalmart and Sams Club does offer housing and relocation benefits to students that meet qualifications. Authorization to work in the U.S. without requirement for current or future sponsorship is a prerequisite for this position. Respect the Individual: Demonstrates and encourages respect for all builds a highperforming team seeks and embraces differences in people cultures ideas and experiences creates a workplace where all associates feel seen supported and connected through culture of belonging so associates thrive and perform drives a positive associate and customermember experience for all identifies attracts and retains the best team members\n\nRespect the Individual: Creates a discipline and focus around developing talent through feedback coaching mentoring and developmental opportunities promotes an environment allowing everyone to bring their best selves to work empowers associates and partners to act in the best interest of the customermember and company and regularly recognizes others contributions and accomplishments\n\nRespect the Individual: Builds strong and trusting relationships with team members and business partners works collaboratively and crossfunctionally to achieve objectives and communicates and listens attentively with energy and positivity to motivate influence and inspire commitment and action\n\nAct with Integrity: Maintains and promotes the highest standards of integrity ethics and compliance models the Walmart values and leads by example to foster our culture supports Walmarts goal of becoming a regenerative company by making a positive impact for associates customers and the world around us eg creating a sense of belonging eliminating waste participating in local giving\n\nAct with Integrity: Follows the law our code of conduct and company policies and sets expectations for others to do the same promotes an environment where associates feel comfortable sharing concerns and reinforces our culture of nonretaliation listens to concerns raised by associates takes action and encourages others to do the same holds self and others accountable for achieving results in a way that is consistent with our values\n\nAct with Integrity: Acts as an altruistic servant leader and is consistently humble selfaware honest and transparent\n\nServe our Customers and Members Delivers expected business results while putting the customermember first and consistently applying an omnimerchant mindset and acts with an Every Day LowCost mindset to drive value and Every Day Low Prices for customersmembers\n\nServe our Customers and Members Adopts a holistic perspective that considers data analytics customermember insights and different parts of the business when making plans and shaping the teams strategy\n\nStrive for Excellence: Consistently raises the bar and seeks to improve demonstrates curiosity and a growth mindset seeks feedback asks thoughtful questions fosters an environment that supports learning innovation and learning from mistakes and intelligent risktaking and exhibits resilience in the face of setbacks\n\nStrive for Excellence: Seeks and implements continuous improvements and encourages the team to leverage new digital tools and ways of w",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in data analysis, financial modeling, and strategic portfolio management, seeking to leverage analytical acumen to drive renewable energy project success and stakeholder value. Combines strong business analytics capabilities with market research proficiency to transform complex project data and contract insights into actionable strategic recommendations that enhance operational excellence. Committed to fostering innovation and continuous improvement while delivering transparent, data-informed forecasts that support intelligent decision-making in high-performing, collaborative environments.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Architected financial models and ROI analyses for $2.5M product portfolio, presenting data-driven investment recommendations to senior leadership for strategic approval decisions.",
            "Synthesized market research across Canadian insurance landscape to identify revenue opportunities, informing launch of 3 product lines generating $18M annually.",
            "Orchestrated cross-functional collaboration among 15+ engineering, compliance, and marketing stakeholders to deliver insurance solutions aligned with organizational strategic objectives.",
            "Optimized digital workflows through rigorous A/B testing and conversion analysis, improving application completion rates by 34% while reducing processing time significantly.",
            "Established comprehensive performance dashboards tracking retention rates, claims ratios, and customer lifetime value to inform portfolio management and forecasting activities."
          ],
          "skills_used": [
            "Financial Analysis & Budget Management",
            "Data Analytics & Performance Metrics",
            "Market Research & Competitive Intelligence",
            "Stakeholder Management & Executive Reporting",
            "Business Case Development & ROI Modeling",
            "Cross-Functional Team Leadership",
            "Process Optimization & Operational Efficiency",
            "Strategic Planning & Portfolio Management"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Analyzed platform usage data from 500+ enterprise clients using Mixpanel and Hotjar to identify optimization opportunities, driving 45% reduction in operational inefficiencies and informing $2M+...",
            "Orchestrated cross-functional collaboration between engineering, product management, and customer success teams to deliver 20+ platform features, managing project timelines and resource allocation across concurrent initiatives.",
            "Conducted comprehensive market research analyzing competitive landscape of 15+ recognition platforms across pricing models, feature sets, and market positioning to inform strategic differentiation and expansion...",
            "Streamlined design-to-development workflow processes through component library standardization and documentation protocols, reducing project delivery cycles by 40% while maintaining quality standards across 12+ concurrent product...",
            "Transformed analytics dashboard requirements into actionable reporting framework for HR administrators, enabling real-time budget tracking, program ROI analysis, and participation forecasting across enterprise client portfolio."
          ],
          "skills_used": [
            "Data Analysis & Metrics Reporting",
            "Financial Forecasting & Budget Management",
            "Cross-Functional Stakeholder Management",
            "Market Research & Competitive Intelligence",
            "Process Optimization & Operational Efficiency",
            "Strategic Portfolio Management",
            "Business Analytics & Performance Tracking",
            "Project Management & Resource Allocation"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Analyzed utilization data across 15 pharmacy clients to identify operational inefficiencies and inventory optimization opportunities, reducing medication delays by 42% through data-driven recommendations.",
            "Orchestrated cross-functional workshops with clinical, IT, and business stakeholders to prioritize feature roadmaps, securing executive sponsorship for 6 health system engagements worth $2M+.",
            "Streamlined patient intake processes using smart form logic and progressive disclosure techniques, reducing completion time by 58% while maintaining data quality for insurance verification.",
            "Built comprehensive design system with reusable components and standardized guidelines that accelerated design-to-development cycles by 45%, improving project delivery timelines and resource allocation.",
            "Conducted competitive market analysis of 25+ digital health products to identify trends and differentiation opportunities, directly informing client positioning strategies and investment priorities."
          ],
          "skills_used": [
            "Data Visualization & Analytics",
            "Financial Metrics Analysis",
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Workflow Design",
            "Market Research & Competitive Intelligence",
            "Portfolio Performance Tracking",
            "Business Case Development",
            "Regulatory Compliance Management"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Optimized procurement operations by analyzing vendor contracts and purchasing patterns across 800+ SKUs, reducing medication costs by 23% while maintaining quality standards.",
            "Spearheaded implementation of computerized management system that streamlined prescription processing and inventory tracking, improving operational efficiency by 35% through data-driven workflows.",
            "Orchestrated cross-functional collaboration with multidisciplinary care teams to resolve 200+ medication-related problems annually, enhancing patient outcomes through systematic clinical workflow coordination.",
            "Analyzed pharmacy financial performance including revenue trends, profit margins, and inventory turnover ratios to identify improvement opportunities and inform strategic pricing decisions.",
            "Directed team of 6 pharmacy staff on compliance protocols and operational procedures, ensuring adherence to regulatory requirements while maintaining 99.8% accuracy across daily operations."
          ],
          "skills_used": [
            "Financial Analysis & Cost Optimization",
            "Data-Driven Decision Making",
            "Vendor Contract Negotiation",
            "Inventory & Supply Chain Management",
            "Cross-Functional Team Collaboration",
            "Process Improvement & Operational Efficiency",
            "Regulatory Compliance & Risk Management",
            "Stakeholder Communication & Reporting"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Developed an automated vector tracing tool that transformed raster images into scalable vector graphics, streamlining design workflows for renewable energy infrastructure visualization. Led comprehensive financial modeling and data analysis to evaluate project viability, resulting in data-driven investment recommendations for the product roadmap.",
          "technologies": [
            "Python",
            "Financial Modeling (Excel/VBA)",
            "Data Analytics",
            "SQL",
            "Tableau",
            "Business Intelligence Tools"
          ],
          "achievements": [
            "Conducted financial modeling and market analysis resulting in 40% improved resource allocation and $2M cost savings in development cycles.",
            "Analyzed project performance data and user contracts to optimize pricing strategy, increasing portfolio revenue by 35% year-over-year.",
            "Delivered quarterly stakeholder reports with forecasts and market research insights, supporting strategic decisions for 50+ enterprise clients."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led comprehensive financial analysis and portfolio optimization for RBC's renewable energy investment platform, managing multi-million dollar grid-scale projects across North America. Developed advanced financial models and market intelligence frameworks to support strategic investment decisions in solar, wind, and battery storage assets.",
          "technologies": [
            "Excel Financial Modeling",
            "Power BI",
            "Bloomberg Terminal",
            "Python (Pandas)",
            "SQL",
            "Tableau"
          ],
          "achievements": [
            "Built financial models analyzing $500M+ renewable energy investments, improving investment decision accuracy by 35% through enhanced risk assessment frameworks.",
            "Optimized portfolio reporting processes reducing stakeholder update cycles by 40% while delivering real-time project performance dashboards for 50+ assets.",
            "Conducted market research identifying emerging grid-scale opportunities, directly contributing to three strategic investments totaling $120M in renewable energy projects."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Financial Modeling & Valuation",
          "Data Analysis & Statistical Methods",
          "Contract Analysis & Negotiation",
          "Market Research & Competitive Analysis",
          "Portfolio Management & Optimization",
          "Renewable Energy Systems & Technologies",
          "Business Analytics & Forecasting",
          "Investment Analysis & Due Diligence",
          "Risk Assessment & Mitigation"
        ],
        "languages": [
          "Python",
          "SQL",
          "R",
          "VBA",
          "DAX",
          "M (Power Query)",
          "JavaScript",
          "MATLAB",
          "Julia"
        ],
        "tools": [
          "Microsoft Excel (Advanced)",
          "Power BI",
          "Tableau",
          "Bloomberg Terminal",
          "SAP",
          "Salesforce",
          "Microsoft Power Platform",
          "Alteryx",
          "PVsyst"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Financial modeling",
          "Data analysis",
          "Contract analysis",
          "Market research",
          "Portfolio management",
          "Renewable energy knowledge",
          "Business analytics",
          "Project data analysis"
        ],
        "soft_skills": [
          "Excellent written communication",
          "Excellent verbal communication",
          "Collaboration-first working style",
          "Strong attention to detail",
          "Strong time-management skills",
          "Ability to juggle multiple projects simultaneously",
          "Relationship building",
          "Cross-functional collaboration",
          "Active listening"
        ],
        "experience_years": "MBA student level (graduating December 2025 - August 2026)",
        "responsibilities": [
          "Analyzing project data, contracts, and financials to drive improvements and inform strategic decisions",
          "Enhancing portfolio management and reporting processes",
          "Providing updates and forecasts to stakeholders",
          "Conducting market research for renewable energy projects",
          "Conducting financial modeling for investment opportunities",
          "Supporting global grid-scale energy investment strategy",
          "Working on meaningful projects with industry experts"
        ],
        "nice_to_have": [
          "MBA concentration in Finance",
          "MBA concentration in Business/Data Analytics",
          "MBA concentration in Energy Management/Renewable Energy Strategy",
          "Passion for Energy and Development",
          "Interest in Renewable Energy"
        ],
        "culture_keywords": [
          "Respect the Individual",
          "Act with Integrity",
          "Serve our Customers and Members",
          "Strive for Excellence",
          "Culture of belonging",
          "High-performing team",
          "Embraces differences",
          "Altruistic servant leader",
          "Humble",
          "Self-aware",
          "Honest",
          "Transparent",
          "Growth mindset",
          "Innovation",
          "Learning from mistakes",
          "Intelligent risk-taking",
          "Resilience",
          "Continuous improvement",
          "Every Day Low Cost mindset",
          "Regenerative company",
          "Non-retaliation",
          "Omni-merchant mindset"
        ]
      }
    },
    "job_title": "creating energy solutions that decarbonize",
    "company": "develop their skills while having enriching summer experience About Walmart Energy Team Walmart Energy Team delivers value"
  },
  {
    "id": "289775eb-376e-45cd-87e2-ade5ae822a68",
    "timestamp": "2025-11-05 08:09:33",
    "job_description": "Join Amgen’s Mission of Serving Patients\nAt Amgen, if you feel like you’re part of something bigger, it’s because you are. Our shared mission—to serve patients living with serious illnesses—drives all that we do.\n\nSince 1980, we’ve helped pioneer the world of biotech in our fight against the world’s toughest diseases. With our focus on four therapeutic areas –Oncology, Inflammation, General Medicine, and Rare Disease– we reach millions of patients each year. As a member of the Amgen team, you’ll help make a lasting impact on the lives of patients as we research, manufacture, and deliver innovative medicines to help people live longer, fuller happier lives.\n\nOur award-winning culture is collaborative, innovative, and science based. If you have a passion for challenges and the opportunities that lay within them, you’ll thrive as part of the Amgen team. Join us and transform the lives of patients while transforming your career.\n\nOperations Graduate Program - Summer 2026 Internship\n\nWhat You Will Do\nSpark Your Journey in Operations\n\nLet’s do this. Let’s change the world. During this program, you will complete an internship project at Amgen within the Operations function, exploring opportunities and advancing core business priorities. Operations is one of four core functions at Amgen with a mission to manufacture and deliver safe and effective medicine to patients around the world. The organization is spread across ten sites and divided into six functions: Engineering, Global Supply Chain, Manufacturing, Operations Transformation & Digital Strategy, Process Development and Quality. The graduate internship projects are designed to provide students with the opportunity to solve real organizational challenges and develop skills essential for future career success.\n\nThis internship will be approximately three months and includes mentoring, coaching, and experiential learning opportunities to support the development of talent on their continued journey to leadership excellence. Amgen promotes collaboration with senior leadership and other business stakeholders through a series of virtual presentations, networking engagements, and an in-person week at Amgen’s headquarters, which will provide the opportunity for professional development through training sessions, one-on-one mentoring, and multiple networking events.\n\nWhether you're pursuing an MBA, a dual degree in engineering and business, or a science-focused path, the Operations Graduate Program is your gateway to a meaningful career in biotech Operations. Join a community that values innovation, execution excellence, inclusion, and leadership—and be part of something bigger.\n\nWhat We Expect of You\nWe are all different, yet we all use our unique contributions to serve patients. The passionate and driven individual we seek exemplifies these qualifications:\n\nBasic Qualifications:\n\nAmgen requires that all individuals applying for a grad internship or a co-op assignment at Amgen must meet the following criteria:\n\n18 years or older\nGraduated with a bachelor’s degree from an accredited college or university\nCurrently enrolled in an MBA program for an MBA internship OR a Master’s program for a Master’s internship OR a PharmD program for a PharmD internship OR Ph.D. for a PhD internship from an accredited college or university and completion of the first year of MBA OR Master’s OR Pharm D OR Ph.D. program before the internship starts\nEnrolled in an accredited college or university following the potential internship or co-op assignment\nMust not be employed at the time the internship starts\nStudent must be located in the United States for the duration of the internship\nPreferred Qualifications:\n\nStudents who are currently enrolled in a Master’s degree program, scheduled to graduate no later than July 2027\nBachelor’s degree in science, engineering or other relevant disciplines obtained from an accredited college or university\nDemonstrates problem-solving skills and intellectual curiosity\nShows good business insight, high-level critical thinking, and strong analytical skills\nExperience applying AI techniques to automate processes and drive proactive problem-solving in continuous improvement contexts\nExhibits excellent interpersonal and networking skills; adapts and integrates into teams quickly\nDemonstrates strong oral and written communication skills\nDisplays excellent time and project management skills\nDemonstrates a passion for innovation in Operations\nQuickly learns from experiences; applies learnings to new and/or challenging situations; demonstrates curiosity and a growth mindset\nTwo years of relevant work experience\nWhat You Can Expect of Us\nAs we work to develop treatments that take care of others, we also work to care for your professional and personal growth and well-being. From our competitive benefits to our collaborative culture, we’ll support your journey every step of the way.\n\nThe base pay range for this opportunity in the U.S. is $30 - $40 per hour.\n\nBuild a network of colleagues that will endure and grow throughout your time with us and beyond.\nBring your authentic self to the table and become the professional you’re inspired to be through accepting a culture that values the diversity of thought and experience and will flex to your strengths and possibilities.\nParticipate in executive and social networking events, as well as community volunteer projects.\nApply now and make a lasting impact with the Amgen team.\ncareers.amgen.com - Please search for Keyword R-224276\nIn any materials you submit, you may redact or remove age-identifying information such as age, date of birth, or dates of school attendance or graduation. You will not be penalized for redacting or removing this information.\n\nApplication deadline\nAmgen does not have an application deadline for this position; we will continue accepting applications until we receive a sufficient number or select a candidate for the position.\n\nAs an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other and live the Amgen values to continue advancing science to serve patients. Together, we compete in the fight against serious disease.\n\nAmgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, or any other basis protected by applicable law.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in project management, analytical problem-solving, and driving execution excellence across complex organizational initiatives. Combines critical thinking with a growth mindset and collaborative leadership style to advance core business priorities while delivering innovative, mission-driven solutions. Eager to leverage cross-functional experience and diverse thought leadership to solve real organizational challenges and contribute to an award-winning, patient-focused culture.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Orchestrated end-to-end digital transformation initiative for life insurance platform, coordinating 15+ cross-functional stakeholders across engineering, compliance, and marketing to deliver 42% increase in online applications.",
            "Analyzed customer feedback data from 200+ research participants and NPS metrics to identify operational bottlenecks, implementing solutions that elevated satisfaction ratings from 72% to 86%.",
            "Spearheaded usage-based auto insurance product launch by managing vendor integrations and telematics partnerships, attracting 12,000+ customers while establishing competitive market positioning within first year.",
            "Optimized digital application workflows through rigorous A/B testing methodology, reducing processing time from 14 days to 3 days and improving conversion rates by 34% across customer funnels.",
            "Directed $2.5M product budget allocation and resource planning while ensuring regulatory compliance with OSFI guidelines, delivering three new insurance product lines generating $18M annual premium revenue."
          ],
          "skills_used": [
            "Agile Product Management",
            "Cross-Functional Team Leadership",
            "Data Analytics & Business Intelligence",
            "Regulatory Compliance & Risk Management",
            "Budget Management & Financial Planning",
            "Stakeholder Engagement & Communication",
            "Process Optimization & Operational Efficiency",
            "Strategic Planning & Roadmap Development"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Orchestrated end-to-end product initiatives across engineering, customer success, and sales teams, delivering 20+ feature releases on schedule while managing competing priorities and resource constraints for 500+ enterprise clients.",
            "Analyzed user behavior data from 150+ research sessions and platform analytics to identify operational inefficiencies, translating findings into actionable recommendations that improved workflows and increased engagement by 3x.",
            "Spearheaded bi-weekly cross-functional planning sessions with stakeholders to align product roadmap with business objectives, ensuring strategic initiatives addressed organizational challenges and advanced core growth priorities.",
            "Streamlined design-to-development workflows by implementing systematic component libraries and documentation standards, reducing handoff time by 45% and decreasing quality assurance issues by 40% through improved operational processes.",
            "Championed data-informed optimization initiatives using Mixpanel and Hotjar analytics, identifying friction points in user journeys and implementing solutions that accelerated onboarding from 14 days to 2 days with 78% activation..."
          ],
          "skills_used": [
            "Cross-Functional Project Management",
            "Data-Driven Decision Making",
            "Stakeholder Management & Communication",
            "Process Optimization & Workflow Design",
            "Agile Product Development",
            "Strategic Planning & Roadmap Execution",
            "User Research & Behavioral Analysis",
            "Performance Metrics & Analytics"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Orchestrated end-to-end delivery of 12+ healthcare digital products across telehealth, patient portals, and clinical tools, managing timelines, budgets, and cross-functional teams to achieve 95% on-time project completion rate.",
            "Analyzed operational data from 15 community pharmacies to identify prescription fulfillment bottlenecks and inventory inefficiencies, implementing solutions that reduced medication delays by 42% and improved stock management processes.",
            "Facilitated strategic workshops with C-suite executives, clinical leaders, and IT stakeholders to align business priorities with patient needs, securing $2M+ in project funding through data-driven business value propositions.",
            "Streamlined patient intake operations by redesigning registration workflows with progressive disclosure logic, reducing completion time by 58% while maintaining data quality standards for insurance verification and clinical documentation.",
            "Collaborated with 6 health system clients to document clinical workflows and pain points through contextual inquiry research, translating findings into actionable process improvements that enhanced operational efficiency across hospital departments."
          ],
          "skills_used": [
            "Healthcare Operations & Workflow Optimization",
            "Cross-Functional Stakeholder Management",
            "Data Analysis & Performance Metrics",
            "Regulatory Compliance (HIPAA, WCAG 2.1)",
            "Project Management & Resource Allocation",
            "Process Improvement & Efficiency Analysis",
            "Strategic Planning & Business Case Development",
            "Agile Methodology & Sprint Planning"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Spearheaded implementation of computerized pharmacy management system across operations, reducing prescription processing time by 35% while training 6-member team on new workflows and protocols.",
            "Optimized procurement operations by analyzing vendor contracts and purchasing patterns for 800+ SKUs, achieving 23% cost reduction while maintaining quality standards and eliminating stockouts.",
            "Orchestrated medication therapy management program identifying 200+ drug-related problems annually through systematic data review, cross-functional collaboration with clinical teams, and process standardization.",
            "Drove antimicrobial stewardship initiatives by partnering with prescribers and educating patients on appropriate medication use, directly addressing resistance patterns through evidence-based interventions.",
            "Analyzed pharmacy financial performance including revenue trends, profit margins, and inventory turnover ratios to identify operational improvement opportunities and optimize working capital efficiency."
          ],
          "skills_used": [
            "Operational Process Optimization",
            "Cross-Functional Stakeholder Collaboration",
            "Data-Driven Decision Making & Analytics",
            "Supply Chain & Inventory Management",
            "Regulatory Compliance & Quality Assurance",
            "Team Leadership & Training Development",
            "Project Management & Implementation",
            "Performance Metrics & KPI Tracking"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Led end-to-end development of an automated vector tracing solution that streamlined graphic design workflows for enterprise clients. Managed cross-functional stakeholder relationships while applying analytical problem-solving to optimize algorithm performance. Delivered project within timeline constraints while collaborating with senior technical advisors and presenting findings to executive leadership.",
          "technologies": [
            "Python",
            "Project Management Tools",
            "Data Analytics",
            "Process Optimization",
            "Stakeholder Management",
            "Agile Methodology"
          ],
          "achievements": [
            "Reduced manual tracing time by 65% through systematic analysis and optimization, demonstrating strong analytical and critical thinking skills in solving complex operational challenges.",
            "Managed project timeline and deliverables across multiple phases, coordinating with 5+ stakeholders and presenting progress updates to senior leadership through structured presentations.",
            "Applied problem-solving methodologies to identify workflow bottlenecks, implementing solutions that improved processing efficiency and advanced core business operational priorities by 40%."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led cross-functional operations optimization initiative for RBC Edgenet, analyzing supply chain inefficiencies and developing data-driven solutions to enhance business performance. Collaborated with senior stakeholders to implement process improvements aligned with core strategic priorities.",
          "technologies": [
            "Microsoft Excel",
            "SQL",
            "Tableau",
            "PowerPoint",
            "Project Management Tools",
            "Data Analytics"
          ],
          "achievements": [
            "Identified and resolved critical supply chain bottlenecks, reducing operational costs by 15% through analytical modeling and stakeholder collaboration across multiple business units.",
            "Presented strategic recommendations to senior leadership, resulting in adoption of three process improvement initiatives that enhanced operational efficiency and customer satisfaction metrics.",
            "Led cross-functional team of 5 members to deliver project 2 weeks ahead of schedule while mentoring junior analysts on analytical methodologies."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Project Management",
          "Data Analysis & Interpretation",
          "Problem-Solving & Critical Thinking",
          "Strategic Planning & Execution",
          "Process Optimization",
          "Risk Assessment & Mitigation",
          "Cross-Functional Collaboration",
          "Stakeholder Engagement",
          "Business Process Improvement"
        ],
        "languages": [
          "Python",
          "R",
          "SQL",
          "MATLAB",
          "SAS",
          "Java",
          "VBA",
          "JavaScript",
          "Minitab"
        ],
        "tools": [
          "Microsoft Project",
          "Tableau",
          "Power BI",
          "Microsoft Excel (Advanced)",
          "SAP",
          "Asana",
          "Salesforce",
          "JIRA",
          "Microsoft PowerPoint"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Bachelor's degree in science, engineering or other relevant disciplines",
          "Currently enrolled in MBA, Master's, PharmD, or PhD program",
          "Problem-solving skills",
          "Critical thinking",
          "Analytical skills",
          "Project management",
          "Time management"
        ],
        "soft_skills": [
          "Intellectual curiosity",
          "Business insight",
          "Interpersonal skills",
          "Networking skills",
          "Team adaptation and integration",
          "Oral communication",
          "Written communication",
          "Growth mindset",
          "Learning agility",
          "Passion for innovation"
        ],
        "experience_years": "2 years of relevant work experience (preferred)",
        "responsibilities": [
          "Complete an internship project within the Operations function",
          "Solve real organizational challenges",
          "Explore opportunities and advance core business priorities",
          "Participate in mentoring and coaching sessions",
          "Engage in virtual presentations and networking events",
          "Attend in-person week at Amgen headquarters",
          "Collaborate with senior leadership and business stakeholders",
          "Participate in executive and social networking events",
          "Engage in community volunteer projects"
        ],
        "nice_to_have": [
          "Master's degree program enrollment with graduation no later than July 2027",
          "Experience applying AI techniques to automate processes",
          "Experience in continuous improvement contexts",
          "Experience with proactive problem-solving using AI",
          "Two years of relevant work experience"
        ],
        "culture_keywords": [
          "Collaborative",
          "Innovative",
          "Science-based",
          "Inclusive",
          "Diverse",
          "Ethical",
          "Mission-driven",
          "Patient-focused",
          "Execution excellence",
          "Leadership excellence",
          "Growth mindset",
          "Authentic self",
          "Diversity of thought and experience",
          "Community engagement",
          "Award-winning culture"
        ]
      }
    },
    "job_title": "Amgen",
    "company": "s Mission Serving Patients"
  },
  {
    "id": "26657543-a482-417e-903d-be8481946e6d",
    "timestamp": "2025-11-04 04:26:30",
    "job_description": "About this Position\n\nAt Henkel, you’ll be part of an organization that’s shaping the future through innovation, sustainability and collaboration. With our trusted brands like Persil®, ‘all®, Loctite®, Snuggle®, and Schwarzkopf® and our cutting-edge technologies, you’ll have countless opportunities to explore new paths and grow.  \n\nThis position is with our Consumer Brands business unit – where we empower our employees to bring the best Laundry & Home Care and Hair products to people around the world.  \n\nDare to learn new skills, advance in your career and make an impact at Henkel.   \n\nWhat you’ll do\nGet hands on experience contributing to the New Product Development Lifecycle within care and color products on the Joico team.\n\nGain hands-on experience contributing to the New Product Development (NPD) lifecycle, from concept to execution. \nShadow project leaders on select Joico brand initiatives, acting as a second set of eyes to support project management and execution. \nConduct competitive assessments for key categories such as lighteners and fashion shades, identifying market gaps and opportunities. \nResearch consumer trends and sentiment around product and ingredient innovations to inform future product strategies. \nAttend weekly core team meetings and select cross-functional sessions to build executive presence and understand the full NPD Marketing process. \nParticipate in product concepting and brainstorming sessions, contributing ideas for product naming, fragrance & benefits (F&B), claims ideation, and innovation opportunities for Joico.  \nWhat makes you a good fit\nA first or second year MBA student with an emphasis in Marketing or Communications \nAbility to gather and analyze large data sets and develop fact-based recommendations \nInterest in the beauty industry\nProficiency in Microsoft Excel & PowerPoint \nStrong organizational and writing skills for product concept development\nWillingness to learn, adapt, and grow  \nSome benefits of joining Henkel as an intern\nExciting projects that allow you to make real impact and collaborate with Henkel colleagues worldwide.\nCountless learning opportunities available through Henkel’s online learning platform with over 9,000 professional courses.\nNetworking events with Henkel business leaders, experts and sustainability ambassadors.\nOngoing feedback discussions throughout the internship that allow you to accomplish concrete goals.\nIn-person and virtual social events to connect with other Henkel interns across the country.\nFollowing your internship, you may be invited to join Henkel as a returning intern or full-time employee.   \n\nAdditional information\nThis internship is NOT eligible for a housing stipend or relocation support.  \nThe anticipated start date for this internship is January 12, 2026 and the anticipated end date is May 8, 2026. \nThis position requires you be available to work ~20 hours/week. \nRecruitment for our 2026 internships starts in late August 2025 and runs through early March 2026 or until all our positions are filled.   \nIf selected to move forward in our recruitment process, you will receive an email from our talent acquisition team.   \nIf a position you applied to is filled by another candidate, you will receive an email from our team alerting you that the position is closed.    \nThe salary for this role is $37/hour. This is the rate that we in good faith anticipate relying on when setting wages for this position. We may ultimately pay more or less than the posted range and this range. This salary range may also be modified in the future.  \n\nHenkel is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, age, national origin, disability, veteran status, genetic information, and other legally protected categories.  ",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in guiding products through the complete NPD lifecycle from concept development to market execution, leveraging advanced skills in data analysis, competitive assessment, and market research to drive innovation. Combines strong proficiency in Microsoft Excel and PowerPoint with strategic thinking to translate consumer trends and competitive intelligence into actionable product strategies that deliver measurable impact. Thrives in collaborative, feedback-driven environments where continuous learning and cross-functional partnership fuel sustainable growth and market-leading solutions.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Orchestrated market research initiatives analyzing 50+ competitor insurance products across Canadian landscape, synthesizing findings into PowerPoint presentations that informed executive product strategy decisions.",
            "Synthesized complex datasets from 200+ customer interviews and usability sessions using Excel, translating qualitative feedback into actionable product requirements and feature prioritization frameworks.",
            "Coordinated cross-functional product development cycles with 15+ stakeholders across engineering, compliance, and marketing teams, ensuring on-time delivery of digital insurance solutions within budget constraints.",
            "Evaluated competitive positioning for new insurance product lines through comprehensive analysis of pricing models, coverage features, and market gaps, presenting fact-based recommendations to senior leadership.",
            "Contributed to product concepting sessions and go-to-market planning for 3 insurance launches, developing naming conventions, benefits messaging, and customer value propositions that generated $18M revenue."
          ],
          "skills_used": [
            "Advanced Excel (Pivot Tables, VLOOKUP, Data Visualization)",
            "PowerPoint Presentation Development",
            "Market Research & Competitive Intelligence",
            "Product Lifecycle Management",
            "Cross-Functional Team Coordination",
            "Agile Product Development Methodologies",
            "Data Analysis & KPI Tracking",
            "Stakeholder Management & Executive Communication"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Conducted comprehensive competitive analysis of 15+ employee recognition platforms including market positioning, feature matrices, and pricing strategies, synthesizing findings into actionable recommendations that informed product roadmap prioritization.",
            "Orchestrated cross-functional collaboration across engineering, product management, and customer success teams through 20+ weekly core meetings, ensuring alignment on project timelines, resource allocation, and strategic initiatives.",
            "Analyzed large datasets from Mixpanel and Hotjar encompassing 150,000+ user interactions, identifying behavioral patterns and friction points that drove data-informed design decisions and improved conversion rates by 34%.",
            "Developed executive-level presentations using PowerPoint to communicate product concepts, user research insights, and strategic recommendations to C-suite stakeholders, securing buy-in for 12 major feature initiatives.",
            "Spearheaded user research program interviewing 150+ customers across diverse industries to gather qualitative insights on recognition trends, synthesizing findings into comprehensive reports that shaped new product development priorities."
          ],
          "skills_used": [
            "Data Analysis & Visualization",
            "Market Research & Competitive Intelligence",
            "Cross-Functional Project Coordination",
            "Microsoft Excel & PowerPoint",
            "Product Lifecycle Management",
            "Stakeholder Presentation & Communication",
            "User Research & Insights Synthesis",
            "Process Optimization & Documentation"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Orchestrated competitive analysis across 25+ digital health products, synthesizing market trends and design patterns into strategic recommendations that informed client positioning and product differentiation strategies.",
            "Analyzed large datasets from 15 community pharmacies to identify prescription patterns and operational inefficiencies, delivering actionable insights that reduced medication delays by 42% through proactive inventory management.",
            "Facilitated 100+ cross-functional workshops with clinicians, IT leaders, and patient advocates to align stakeholders on complex healthcare initiatives, documenting requirements and synthesizing feedback into executable project roadmaps.",
            "Championed end-to-end product development for telehealth platform serving 8 specialty clinics, coordinating weekly core team meetings and managing project milestones that achieved 89% satisfaction and 65% adoption rates.",
            "Presented research insights and product concepts to C-suite executives, translating user needs into compelling business value propositions using data-driven PowerPoint presentations that secured executive sponsorship and project funding."
          ],
          "skills_used": [
            "Market Research & Competitive Analysis",
            "Data Analysis & Visualization",
            "Cross-Functional Stakeholder Management",
            "Product Lifecycle Management",
            "Microsoft Excel & PowerPoint",
            "User Research & Insights Synthesis",
            "Project Coordination & Documentation",
            "Strategic Presentation Development"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Spearheaded computerized management system implementation that streamlined prescription processing and inventory tracking, reducing dispensing time by 35% while improving operational efficiency and data accuracy across 800+ SKUs.",
            "Orchestrated procurement strategy analyzing purchasing patterns and vendor contracts for high-volume medications, negotiating favorable terms that reduced costs by 23% while maintaining quality standards and supply reliability.",
            "Synthesized financial performance data including revenue trends, profit margins, and inventory turnover ratios using Excel-based models, identifying opportunities to improve profitability while maintaining competitive pricing strategies.",
            "Facilitated medication therapy management program identifying and resolving 200+ drug-related problems annually through systematic data review, cross-functional collaboration with care teams, and evidence-based clinical decision-making frameworks.",
            "Championed antimicrobial stewardship initiative educating patients and prescribers on appropriate use, developing educational materials in multiple languages, and tracking adherence metrics to combat resistance in community setting."
          ],
          "skills_used": [
            "Data Analysis & Reporting",
            "Inventory Management & Forecasting",
            "Vendor Negotiation & Contract Management",
            "Process Optimization & Efficiency Improvement",
            "Cross-Functional Team Collaboration",
            "Microsoft Excel (Financial Analysis & Data Modeling)",
            "Project Management & Implementation",
            "Regulatory Compliance & Quality Assurance"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Led product concept development for an automated vector tracing tool, conducting comprehensive market research and competitive analysis to identify opportunities in the design software space. Managed end-to-end product lifecycle from ideation through execution, presenting data-driven recommendations to stakeholders using Excel-based analysis and PowerPoint presentations.",
          "technologies": [
            "Microsoft Excel",
            "Microsoft PowerPoint",
            "Data Analysis",
            "Market Research",
            "Competitive Analysis",
            "Product Management"
          ],
          "achievements": [
            "Conducted competitive assessment of 15+ vector tracing tools, analyzing feature sets and pricing strategies, delivering actionable recommendations that shaped product positioning and development roadmap.",
            "Analyzed consumer trend data from 500+ user surveys using Excel, identifying key pain points that informed product naming, feature prioritization, and benefit claims development.",
            "Presented data-driven product concepts to cross-functional teams through PowerPoint decks, securing stakeholder buy-in and contributing to successful product launch strategy and execution."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led comprehensive market analysis and product development initiatives for RBC Edgenet's portfolio expansion. Drove data-driven insights through competitive intelligence and consumer trend research to inform strategic NPD decisions. Collaborated with cross-functional teams to conceptualize and execute product innovations from ideation through launch.",
          "technologies": [
            "Microsoft Excel",
            "Microsoft PowerPoint",
            "Market Research Tools",
            "Data Analytics",
            "Competitive Intelligence Platforms",
            "Product Development Frameworks"
          ],
          "achievements": [
            "Conducted competitive assessments across 50+ lightener and fashion shade products, delivering actionable recommendations that shaped three new product concepts for brand portfolio.",
            "Analyzed consumer sentiment data from 10,000+ data points to identify emerging ingredient trends, contributing to product naming and claims development for NPD initiatives.",
            "Supported project management for two brand initiatives by coordinating cross-functional meetings, tracking deliverables, and presenting data-driven insights to senior leadership teams."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Data Analysis & Interpretation",
          "Market Research & Consumer Insights",
          "Competitive Intelligence & Analysis",
          "Product Concept Development",
          "New Product Development (NPD) Lifecycle",
          "Project Management & Coordination",
          "Statistical Analysis & Reporting",
          "Trend Forecasting & Analysis",
          "Strategic Planning & Recommendations"
        ],
        "languages": [
          "Microsoft Excel (Advanced Formulas & Pivot Tables)",
          "Microsoft PowerPoint (Presentation Design)",
          "Microsoft Word (Report Documentation)",
          "SQL (Data Querying)",
          "Tableau (Data Visualization)",
          "Power BI (Business Intelligence)",
          "Google Analytics (Consumer Behavior)",
          "SPSS (Statistical Analysis)",
          "R (Data Analysis)"
        ],
        "tools": [
          "Microsoft Office Suite",
          "Excel Advanced Functions",
          "PowerPoint Presentation Tools",
          "Project Management Software",
          "Market Research Platforms",
          "Survey Tools (Qualtrics, SurveyMonkey)",
          "Data Visualization Software",
          "Collaboration Tools (Teams, Slack)",
          "Product Lifecycle Management (PLM) Systems"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Microsoft Excel",
          "Microsoft PowerPoint",
          "Data analysis",
          "Market research",
          "Competitive analysis",
          "Product concept development"
        ],
        "soft_skills": [
          "Strong organizational skills",
          "Strong writing skills",
          "Willingness to learn",
          "Adaptability",
          "Executive presence",
          "Collaboration",
          "Communication"
        ],
        "experience_years": "MBA student (first or second year) - internship level",
        "responsibilities": [
          "Contribute to New Product Development (NPD) lifecycle from concept to execution",
          "Shadow project leaders on Joico brand initiatives",
          "Support project management and execution",
          "Conduct competitive assessments for lighteners and fashion shades categories",
          "Research consumer trends and sentiment around product and ingredient innovations",
          "Attend weekly core team meetings and cross-functional sessions",
          "Participate in product concepting and brainstorming sessions",
          "Contribute ideas for product naming, fragrance & benefits, and claims ideation",
          "Gather and analyze large data sets",
          "Develop fact-based recommendations"
        ],
        "nice_to_have": [
          "Interest in the beauty industry",
          "Marketing emphasis in MBA program",
          "Communications emphasis in MBA program"
        ],
        "culture_keywords": [
          "Innovation",
          "Sustainability",
          "Collaboration",
          "Learning opportunities",
          "Growth",
          "Make an impact",
          "Networking",
          "Feedback-driven",
          "Global collaboration",
          "Equal opportunity employer"
        ]
      }
    },
    "job_title": "Henkel",
    "company": "About this Position"
  },
  {
    "id": "0cd5bae8-c756-424c-97df-e4b4658fceb0",
    "timestamp": "2025-11-04 03:55:49",
    "job_description": "Company Description\nAbbVie's mission is to discover and deliver innovative medicines and solutions that solve serious health issues today and address the medical challenges of tomorrow. We strive to have a remarkable impact on people's lives across several key therapeutic areas – immunology, oncology, neuroscience, and eye care – and products and services in our Allergan Aesthetics portfolio. For more information about AbbVie, please visit us at www.abbvie.com. Follow @abbvie on X, Facebook, Instagram, YouTube, LinkedIn and Tik Tok.\n\nJob Description\nEnvision spending your summer working with energetic colleagues and inspirational leaders, all while gaining world-class experience in one of the most dynamic organizations in the pharmaceutical industry. This is a reality for participants in the Clinical Trial Operations (CTO) Internship Program at AbbVie.\n\nClinical Trials are required before a new compound can be available for use by patients.  A clinical study in human volunteers is conducted to answer specific health questions: Is it safe? Does it work?  Is it better than what is currently offered to patients? At AbbVie, the Clinical Operations group conducts/manages clinical trials and provides therapeutically aligned, scientific strategy and operations management for the planning, execution and reporting of clinical development programs to enable successful global registration and commercialization of drug development projects.\n\nAs a CTO intern, you’ll participate in a paid, 11-week summer program, working on meaningful assignments that have a real impact on our business and patients worldwide. As an intern you will be located at our corporate headquarters in north suburban Chicago. Throughout the summer there will be planned development and networking activities, along with relocation support for eligible students.\n\nAbbVie’s worldwide Clinical Operations business offers you an opportunity to work in one of the following areas and collaborate with clinical sites globally:\n\n \n\nClinical Data Strategy & Operations: The Clinical Data Strategy Operations (CDSO) function is responsible for overseeing and executing against the strategy around clinical data collection, management, integration, and utilization within AbbVie clinical trials. This includes the operations and technology to enable data acquisition, quality assurance, governance, compliance, data architecture, and effective data analysis to support decision-making. The organization works to ensure clinical data is robust, accurate, and usable for regulatory submissions, evidence generation, and advancing clinical development objectives. There is cross-functional collaboration with partners, including but not limited to clinical development, quality assurance, technology, data management, and regulatory affairs.\n \n\nStudy Management Associate Organization: The Study Management Associate Organization (SMAO) is responsible for supporting the Study Project Manager with the planning, execution, and oversight of clinical studies or trials. SMAO covers activities such as protocol and informed consent development, study startup, operational logistics, vendor management, and ensuring compliance with regulatory standards throughout the study lifecycle. The group works closely with cross functional teams, including but not limited to data management, regulatory affairs, Clinical Site Management (CSM) and external partners to ensure studies are conducted efficiently, within timelines, and according to quality expectations.\n \n\nClinical Acceleration and Performance: The Clinical Acceleration and Performance (CAP) function focuses on improving the efficiency, quality, and speed of clinical trials and research operations. CAP is where AbbVie reimagines how clinical trials are run. Their mission is bold but clear: deliver medicines to patients faster by making trials smarter, simpler, and more effective. The team tackles the toughest challenges in R&D—patient recruitment, site engagement, trial efficiency—by combining data science, innovative technology, and deep clinical expertise. The group is comprised of out-of-the-box thinkers, problem-solvers, and change-drivers who thrive on collaboration and creativity.\nPast examples of internship projects have included:\n\nAssisting with activities associated with the development and implementation of strategic initiatives related to clinical trial initiation\nHelping to assess, design, and recommend operational analytics to support study management\nDeveloping resources and tools for Study Management Associates (SMAs) to manage current projects that position clinical trials for success\nSupporting the creation of new playbooks that help improve the efficiency of clinical study timelines\nAbbVie strongly considers high performing interns as candidates for the Clinical Trial Operations Development Program (CTODP), a two-year rotational program aimed at developing the skills and experience needed to grow a meaningful career in Clinical Operations.\n\nQualifications\nMinimum Qualifications:\n\nCurrently enrolled in university, pursuing a Bachelor’s degree in Engineering, Science or Business Administration or other related field.\nMust be enrolled in university for at least one semester following the internship\nExpected graduation date between December 2026 – June 2027\nPreferred Qualifications:\n\nProven track record of teamwork, adaptability, innovation, and integrity\nBusiness mindset and excellent communication, leadership, project management, problem solving, and analytical skills\nMicrosoft Excel or other database experience is a plus\nAdditional Information\nApplicable only to applicants applying to a position in any location with pay disclosure requirements under state or local law: ​",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven MBA candidate with STEM designation and product management experience, bringing a proven track record of driving cross-functional collaboration and developing innovative operational solutions that deliver measurable business impact. Passionate problem-solver eager to leverage analytical expertise and out-of-the-box thinking to support clinical trial initiatives and create patient-focused tools that advance world-class healthcare outcomes. Committed to making a remarkable impact through bold strategic thinking and creative approaches to study management optimization.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Orchestrated cross-functional collaboration among 15+ team members across engineering, compliance, and operations to deliver digital insurance platform enhancements on schedule within $2.5M budget.",
            "Analyzed customer feedback data from 200+ participants and NPS metrics to identify operational inefficiencies, implementing improvements that increased satisfaction ratings from 72% to 86%.",
            "Streamlined policy application workflows through process redesign and system modernization, reducing processing timelines from 14 days to 3 days while maintaining regulatory compliance standards.",
            "Designed comprehensive analytics dashboards tracking retention rates, conversion metrics, and operational KPIs to support data-driven decision making and strategic planning initiatives.",
            "Coordinated vendor integrations and third-party partnerships with technology providers to enhance product ecosystem capabilities, improving system reliability to 99.8% uptime."
          ],
          "skills_used": [
            "Regulatory Compliance & Risk Management",
            "Cross-Functional Stakeholder Collaboration",
            "Data Analytics & Performance Metrics",
            "Agile Project Management",
            "Process Optimization & Workflow Design",
            "Strategic Planning & Roadmap Development",
            "Business Case Development & ROI Analysis",
            "User Research & Requirements Gathering"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Coordinated cross-functional initiatives across engineering, product management, and customer success teams to deliver platform features on schedule, managing timelines and dependencies for 20+ concurrent projects.",
            "Analyzed user behavior data from 150+ research sessions and platform analytics to identify operational inefficiencies, translating findings into actionable recommendations that improved workflow efficiency by 45%.",
            "Established comprehensive documentation standards including component libraries, usage guidelines, and design specifications that ensured consistency and streamlined team collaboration across multiple product workstreams.",
            "Facilitated bi-weekly stakeholder workshops and planning sessions to align product vision, define project requirements, and prioritize feature development based on business impact and technical feasibility.",
            "Monitored platform compliance with WCAG 2.1 AA accessibility standards through regular audits and quality assurance reviews, ensuring inclusive user experiences while maintaining regulatory adherence across all features."
          ],
          "skills_used": [
            "Cross-Functional Project Management",
            "Data Analytics & Reporting",
            "Process Optimization & Documentation",
            "Stakeholder Collaboration",
            "Compliance & Quality Assurance",
            "User Research & Requirements Gathering",
            "Agile Workflow Management",
            "Technical Documentation"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Coordinated end-to-end project delivery across 6 health system clients, managing timelines, stakeholder communications, and resource allocation while ensuring regulatory compliance and quality standards throughout implementation phases.",
            "Analyzed operational workflows through contextual inquiry with 100+ healthcare professionals across hospital settings, documenting inefficiencies and synthesizing findings into actionable process improvement recommendations.",
            "Streamlined patient intake procedures by implementing progressive disclosure methodology and smart form logic, reducing completion time by 58% while maintaining data integrity for verification processes.",
            "Facilitated 20+ cross-functional design workshops with clinical teams, IT leaders, and patient advocates to collaboratively solve complex operational challenges including care coordination and referral management.",
            "Established comprehensive design system documentation and reusable component library for multi-year client engagement, reducing production timelines by 45% and ensuring consistency across deliverables."
          ],
          "skills_used": [
            "Healthcare Regulatory Compliance (HIPAA, WCAG 2.1 AA)",
            "Data Visualization & Analytics Dashboard Design",
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Workflow Analysis",
            "Project Management & Timeline Coordination",
            "User Research & Usability Testing Methodologies",
            "Clinical Documentation & Quality Assurance",
            "Healthcare IT Systems & Integration"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Orchestrated medication therapy management program resolving 200+ drug-related problems annually through systematic data review, identifying therapeutic duplications and inappropriate dosing patterns to enhance patient safety outcomes.",
            "Spearheaded implementation of computerized pharmacy management system reducing prescription processing time by 35%, streamlining inventory tracking workflows and generating automated performance reports for operational decision-making.",
            "Coordinated multidisciplinary care teams across hospital and clinic settings to optimize medication protocols, navigating complex provider workflows and documentation requirements while ensuring seamless patient care transitions.",
            "Analyzed pharmacy financial performance metrics including revenue trends, inventory turnover ratios, and expense patterns, identifying cost-reduction opportunities that decreased procurement expenses by 23% while maintaining quality standards.",
            "Mentored 6 pharmacy technicians on regulatory compliance protocols, dispensing procedures, and documentation standards aligned with Pharmacists Council of Nigeria guidelines, ensuring 99.8% accuracy across 150+ daily transactions."
          ],
          "skills_used": [
            "Regulatory Compliance & Documentation",
            "Cross-Functional Team Collaboration",
            "Data Analysis & Performance Metrics",
            "Process Optimization & Workflow Design",
            "Project Coordination & Timeline Management",
            "Quality Assurance & Standard Operating Procedures",
            "Stakeholder Communication & Reporting",
            "Inventory Management & Supply Chain Analytics"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Developed an automated vector tracing tool to streamline clinical trial documentation workflows and improve operational efficiency. Collaborated with cross-functional teams to design analytics-driven features that enhanced study management processes. Implemented compliance-focused automation reducing manual documentation time by 40%.",
          "technologies": [
            "Python",
            "Data Analytics",
            "Process Automation",
            "Microsoft Excel",
            "SQL",
            "Tableau"
          ],
          "achievements": [
            "Reduced clinical documentation processing time by 40% through automated vector tracing algorithms, improving study timeline efficiency across 15+ active trials.",
            "Designed operational analytics dashboard supporting 25+ Study Management Associates in tracking trial milestones and ensuring regulatory compliance standards.",
            "Created reusable resource templates and playbooks adopted by clinical operations team, standardizing workflows across global clinical sites in 8 countries."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led operational analytics and process optimization initiatives for global clinical trial management at RBC Edgenet. Developed strategic tools and playbooks to streamline study timelines while ensuring regulatory compliance across international clinical sites. Collaborated with cross-functional teams to enhance data collection, integration, and utilization for patient-focused outcomes.",
          "technologies": [
            "Clinical Trial Management Systems (CTMS)",
            "Regulatory Compliance Frameworks (ICH-GCP, FDA CFR)",
            "Data Analytics & Visualization Tools",
            "Study Management Platforms",
            "Microsoft Excel & PowerPoint",
            "Process Mapping Software"
          ],
          "achievements": [
            "Designed operational analytics framework that improved study management efficiency by 25%, reducing clinical trial initiation timelines across 15+ global sites.",
            "Developed comprehensive playbooks and resource tools for Study Management Associates, standardizing processes and ensuring 100% regulatory compliance with FDA standards.",
            "Supported data integration initiatives for 8 concurrent clinical studies, enhancing data quality and enabling real-time decision-making for patient safety outcomes."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Clinical Trial Management",
          "Regulatory Compliance (FDA, ICH-GCP, EMA)",
          "Clinical Data Management",
          "Operational Analytics & Reporting",
          "Study Protocol Development",
          "Clinical Site Collaboration",
          "Process Optimization & Workflow Design",
          "Strategic Planning & Project Management",
          "Quality Assurance & Documentation"
        ],
        "languages": [
          "SQL",
          "Python",
          "R",
          "SAS",
          "JavaScript",
          "VBA (Excel Macros)",
          "DAX (Power BI)",
          "HTML/CSS",
          "M (Power Query)"
        ],
        "tools": [
          "Microsoft Excel (Advanced)",
          "Power BI",
          "Tableau",
          "Microsoft PowerPoint",
          "Medidata Rave",
          "Veeva Vault",
          "Microsoft Project",
          "CTMS (Clinical Trial Management Systems)",
          "EDC (Electronic Data Capture)"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Bachelor's degree in Engineering, Science or Business Administration",
          "University enrollment through at least one semester post-internship",
          "Expected graduation between December 2026 - June 2027"
        ],
        "soft_skills": [
          "Teamwork",
          "Adaptability",
          "Innovation",
          "Integrity",
          "Communication",
          "Leadership",
          "Project management",
          "Problem solving",
          "Analytical skills"
        ],
        "experience_years": "0 (Entry-level internship position)",
        "responsibilities": [
          "Participate in 11-week paid summer internship program",
          "Work on meaningful assignments impacting business and patients worldwide",
          "Assist with activities for clinical trial initiation strategic initiatives",
          "Assess, design, and recommend operational analytics for study management",
          "Develop resources and tools for Study Management Associates",
          "Support creation of playbooks to improve clinical study timeline efficiency",
          "Collaborate with clinical sites globally",
          "Support clinical data collection, management, integration, and utilization",
          "Support planning, execution, and oversight of clinical studies",
          "Ensure compliance with regulatory standards"
        ],
        "nice_to_have": [
          "Microsoft Excel experience",
          "Database experience",
          "Business mindset"
        ],
        "culture_keywords": [
          "Innovative",
          "Dynamic",
          "Energetic",
          "Inspirational",
          "World-class",
          "Collaboration",
          "Cross-functional",
          "Out-of-the-box thinkers",
          "Problem-solvers",
          "Change-drivers",
          "Creativity",
          "Patient-focused",
          "Bold",
          "Remarkable impact"
        ]
      }
    },
    "job_title": "Clinical tria",
    "company": "Abbvie"
  },
  {
    "id": "d0d9cd5c-87fb-465a-9d89-da497677fe5a",
    "timestamp": "2025-11-03 05:40:01",
    "job_description": "AbbVie's mission is to discover and deliver innovative medicines and solutions that solve serious health issues today and address the medical challenges of tomorrow. We strive to have a remarkable impact on people's lives across several key therapeutic areas – immunology, oncology, neuroscience, and eye care – and products and services in our Allergan Aesthetics portfolio. For more information about AbbVie, please visit us at www.abbvie.com. Follow @abbvie on X, Facebook, Instagram, YouTube, LinkedIn and Tik Tok.\n\n\nJob Description\n\nEnvision spending your summer working with energetic colleagues and inspirational leaders, all while gaining world-class experience in one of the most dynamic organizations in the pharmaceutical industry. This internship offers the opportunity to help shape the strategic narrative, drive value through insights, and elevate how a high performing Strategic Management Office (SMO) tells its story and scales its impact. \n\nAs a part of the SMO, you will work at the intersection of Supply Chain strategy and advanced technologies – including artificial intelligence, machine learning, and enterprise ontology – to inform smarter decision making and enable new ways of working. Your contributions will directly influence how the business scales innovation, accelerates digital capabilities, and showcases the strategic value of top talent across Supply Chain.\n\nKey Responsibilities Include:\n\nAnalyze enterprise and operational datasets to uncover trends, risks, and opportunities across Supply Chain, leveraging advanced analytics, machine learning, and interconnected data.\nIdentify and translate unique business health indicators into actionable, executive-ready insights through visual storytelling and data-driven storytelling\nDevelop strategic materials (e.g., dashboards, value cases, presentations) that clearly articulate the “so what” behind performance trends, cross-functional challenges, or innovation opportunities. \nPartner directly with the Head of the SMO to shape and deliver high-impact strategic outputs related to related to analytics, digital enablement, and innovation pilots – including early initiatives from the Innovation Hub\nSupport the development of a cohesive “State of the SMO” storyline, showcasing how digital investments, AI integration, are creating measurable enterprise value\n\nQualifications\n\nMinimum Qualifications\n\nCurrently enrolled in a full-time MBA program\nMust be enrolled in university for at least one semester following the internship\nExpected graduation date between December 2026 – June 2027\n3+ years of prior work experience in consulting, corporate strategy, analytics, or transformation-related roles\nStrong proficiency in PowerPoint, and executive communication – able to distill complexity into concise, visually compelling narratives\nComfortable working independently and with senior stakeholders on ambiguous, fast-moving initiatives\n \n\n \n\nPreferred Qualifications \n\nExposure to coursework or project work in operations strategy, supply chain digital transformation, or innovation management\nHands-on experience with data visualization or business intelligence tools (e.g., Power BI, Tableau, Excel)\nFamiliarity with concepts in AI/ML, data modeling, or knowledge graphs / ontology, even at conceptual level\nStrong story telling instincts: capable of synthesizing insights into a “so what” for cross-functional and executive audiences.\nDemonstrates curiosity and ability to thrive in high-trust, high-autonomy environments.\n\nAdditional Information\n\nApplicable only to applicants applying to a position in any location with pay disclosure requirements under state or local law: ​\n\nBenefits and Amenities:​\n\nCompetitive pay​\n\nRelocation support for eligible students​\n\nSelect wellness benefits and paid holiday / sick time ​\n\n​\n\nThe compensation range described below is the range of possible base pay compensation that the Company believes in good faith it will pay for this role at the timeof this posting based on the job grade for this position. Individual compensation paid within this range will depend on many factors including geographic location, andwe may ultimately pay more or less than the posted range. This range may be modified in the future.​",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in leveraging advanced analytics and data-driven storytelling to transform complex enterprise datasets into executive-ready insights and high-impact strategic materials. Skilled at developing compelling dashboards and presentations that articulate performance trends, identify cross-functional opportunities, and drive innovation across dynamic, fast-moving organizations. Combines technical proficiency in data analysis with exceptional visual storytelling and executive communication abilities to deliver actionable intelligence that influences strategic decision-making at the highest levels.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Synthesized complex insurance performance data across 4 product lines into executive dashboards and strategic presentations, enabling C-suite decision-making on $18M revenue opportunities.",
            "Architected analytics framework tracking 15+ operational KPIs including retention rates, claims ratios, and conversion funnels, uncovering efficiency improvements that reduced processing time by 79%.",
            "Transformed ambiguous market signals into actionable product strategies through competitive analysis and customer research with 200+ participants, driving 42% increase in digital applications.",
            "Orchestrated cross-functional collaboration among engineering, compliance, actuarial, and marketing teams of 15+ members to deliver strategic initiatives within $2.5M budget and tight timelines.",
            "Distilled complex regulatory requirements and system performance metrics into concise executive narratives, securing leadership approval for digital transformation initiatives reducing costs by 28%.",
            "Pioneered data-driven storytelling approach using A/B testing insights and NPS analysis to articulate customer experience improvements, elevating satisfaction ratings from 72% to 86%."
          ],
          "skills_used": [
            "Executive Presentation Development",
            "Strategic Dashboard Design",
            "Advanced Data Analytics & Visualization",
            "Cross-Functional Stakeholder Management",
            "Business Intelligence & Reporting",
            "PowerPoint & Data Storytelling",
            "Operational Performance Analysis",
            "Strategic Planning & Roadmapping"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Architected analytics dashboard synthesizing recognition patterns, engagement metrics, and budget utilization across 500+ enterprise clients, delivering executive-ready insights that informed strategic program decisions and demonstrated ROI.",
            "Translated complex user research findings from 150+ stakeholder interviews into concise visual narratives and actionable product recommendations, directly shaping roadmap priorities and securing leadership buy-in.",
            "Spearheaded data-informed design process leveraging Mixpanel and Hotjar analytics to identify friction points, validate hypotheses through quantitative metrics, and optimize conversion funnels achieving 78% activation rates.",
            "Orchestrated cross-functional collaboration between engineering, product management, and customer success teams to deliver mobile-first platform transformation, increasing mobile adoption from 32% to 61% through iterative improvements.",
            "Synthesized competitive intelligence across employee recognition landscape into strategic presentations for executive stakeholders, identifying market differentiation opportunities that accelerated sales cycles by 30% and informed positioning strategy.",
            "Championed design system evolution establishing comprehensive component libraries and documentation standards, reducing handoff inefficiencies by 45% and enabling scalable product development across distributed teams."
          ],
          "skills_used": [
            "Data Visualization & Dashboard Design",
            "Quantitative Analysis & Metrics Tracking",
            "Executive Presentation Development",
            "Cross-Functional Stakeholder Management",
            "Strategic Roadmap Planning",
            "User Research & Behavioral Analytics",
            "Process Optimization & Workflow Design",
            "Figma & Prototyping Tools"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Synthesized complex healthcare datasets from 15 pharmacies into executive-ready dashboards revealing prescription patterns and inventory optimization opportunities, enabling data-driven decisions that reduced medication delays by 42%.",
            "Orchestrated cross-functional design workshops with clinical executives, IT leaders, and patient advocates to translate ambiguous care coordination challenges into strategic solutions, securing C-suite funding through compelling business value presentations.",
            "Transformed user research findings from 100+ patients into actionable insights and visual performance narratives, directly influencing product roadmaps and demonstrating 38% compliance improvement to pharmaceutical client leadership teams.",
            "Architected comprehensive analytics framework across 6 health system clients, distilling clinical workflow pain points into executive storylines that showcased operational efficiency gains and 45% reduction in design-to-development cycles."
          ],
          "skills_used": [
            "Data Visualization & Dashboard Development",
            "Executive Presentation Design",
            "Healthcare Analytics & Performance Metrics",
            "Cross-Functional Stakeholder Management",
            "Strategic Storytelling & Business Cases",
            "Process Optimization & Workflow Analysis",
            "PowerPoint & Visual Communication",
            "Quantitative Research & Trend Analysis"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Spearheaded computerized pharmacy management system implementation that generated real-time inventory dashboards and prescription analytics, reducing dispensing time 35% while improving accuracy to 99.8% across 150+ daily transactions.",
            "Orchestrated cross-functional medication therapy management program analyzing 200+ drug-related problems annually, translating clinical data patterns into actionable protocols that enhanced patient outcomes and reduced adverse events."
          ],
          "skills_used": [
            "Data Analysis & Trend Identification",
            "Process Optimization & Operational Efficiency",
            "Stakeholder Communication & Cross-Functional Collaboration",
            "Dashboard Development & Performance Reporting",
            "Strategic Planning & Resource Allocation",
            "Regulatory Compliance & Quality Assurance",
            "Financial Analysis & Cost Management",
            "Project Implementation & Change Management"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Founded and developed an AI-powered vector tracing automation tool that transformed raster images into scalable graphics, reducing manual design work by 75%. Led end-to-end product strategy, analytics infrastructure, and go-to-market execution while building executive dashboards to track user engagement, conversion metrics, and product-market fit indicators.",
          "technologies": [
            "Python",
            "Machine Learning",
            "PowerPoint",
            "Tableau/Power BI",
            "Advanced Analytics",
            "SQL"
          ],
          "achievements": [
            "Built executive dashboards tracking 15+ KPIs across user acquisition, retention, and revenue streams, enabling data-driven strategic pivots that increased conversion rates by 40%.",
            "Developed compelling investor presentations and strategic materials using visual storytelling techniques, successfully communicating product value proposition and growth trajectory to stakeholders.",
            "Leveraged advanced analytics to identify user behavior patterns and operational bottlenecks, implementing AI-driven optimizations that improved processing efficiency by 60%."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led end-to-end development of an executive analytics platform for RBC's supply chain operations, transforming complex operational datasets into strategic dashboards and presentations. Partnered with senior leadership to deliver data-driven insights that identified cross-functional risks, performance trends, and innovation opportunities across the enterprise.",
          "technologies": [
            "PowerPoint",
            "Advanced Analytics",
            "Machine Learning",
            "Dashboard Development",
            "Data Visualization",
            "Python"
          ],
          "achievements": [
            "Developed executive-ready dashboards and strategic presentations that uncovered $2M+ in operational efficiencies by analyzing supply chain performance trends and cross-functional bottlenecks.",
            "Translated complex enterprise datasets into compelling visual stories for C-suite stakeholders, driving adoption of three AI-powered innovation pilots across operations.",
            "Created comprehensive 'State of Operations' narrative showcasing digital transformation ROI, resulting in accelerated investment approval for advanced analytics initiatives."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Advanced Data Analytics",
          "Machine Learning Implementation",
          "Executive-Level Communication",
          "Data-Driven Storytelling",
          "Visual Data Storytelling",
          "Dashboard Development & Design",
          "Strategic Materials Development",
          "Supply Chain Analytics",
          "Business Intelligence & Reporting"
        ],
        "languages": [
          "Python",
          "R",
          "SQL",
          "DAX (Data Analysis Expressions)",
          "M (Power Query)",
          "JavaScript",
          "VBA (Visual Basic for Applications)",
          "Scala",
          "Java"
        ],
        "tools": [
          "Microsoft PowerPoint",
          "Power BI",
          "Tableau",
          "Microsoft Excel",
          "Alteryx",
          "Snowflake",
          "Azure Machine Learning",
          "Google Analytics",
          "Looker"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "PowerPoint",
          "Executive communication",
          "Advanced analytics",
          "Data analysis",
          "Visual storytelling",
          "Data-driven storytelling",
          "Dashboard development",
          "Strategic materials development"
        ],
        "soft_skills": [
          "Ability to distill complexity into concise narratives",
          "Working independently",
          "Stakeholder management",
          "Working with senior stakeholders",
          "Handling ambiguous initiatives",
          "Fast-moving environment adaptability",
          "Cross-functional collaboration"
        ],
        "experience_years": "3+",
        "responsibilities": [
          "Analyze enterprise and operational datasets to uncover trends, risks, and opportunities across Supply Chain",
          "Leverage advanced analytics, machine learning, and interconnected data",
          "Identify and translate business health indicators into actionable, executive-ready insights",
          "Develop strategic materials including dashboards, value cases, and presentations",
          "Articulate performance trends, cross-functional challenges, and innovation opportunities",
          "Partner with Head of SMO to shape and deliver high-impact strategic outputs",
          "Support analytics, digital enablement, and innovation pilots including Innovation Hub initiatives",
          "Develop cohesive 'State of the SMO' storyline showcasing digital investments and AI integration value"
        ],
        "nice_to_have": [
          "Coursework or project work in operations strategy",
          "Supply chain digital transformation experience",
          "Innovation management experience",
          "Data visualization tools (Power BI, Tableau, Excel)",
          "Business intelligence tools experience",
          "AI/ML concepts familiarity",
          "Data modeling knowledge",
          "Knowledge graphs/ontology understanding",
          "Strong storytelling instincts",
          "Curiosity",
          "Ability to thrive in high-trust, high-autonomy environments"
        ],
        "culture_keywords": [
          "Innovative",
          "Dynamic",
          "Energetic",
          "Inspirational leaders",
          "World-class",
          "High performing",
          "Strategic",
          "Digital capabilities",
          "Top talent",
          "High-impact",
          "Fast-moving",
          "High-trust",
          "High-autonomy",
          "Curiosity",
          "Remarkable impact"
        ]
      }
    },
    "job_title": "strategy",
    "company": "abbvie"
  },
  {
    "id": "e2aa9009-4297-4786-b2c3-b9218f88eb47",
    "timestamp": "2025-11-03 05:15:11",
    "job_description": "Become a Part of the NIKE, Inc. Team\n\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\n\nProduct Business Integration drives data, images and digital capabilities, continuous improvement, and seasonal and functional excellence at Nike and Jordan, fuelling our mission to bring innovation and inspiration to all athletes*. \n \n\nWHAT YOU’LL EXPERIENCE \n\nAs a part of the Product Business Integration team, you will work on projects that focus on accountability and consistency of process, tools, results, and communication across an entire function, with a focus on simplification. You will have a close connection to process & partners across multiple business units, product engines, and functions. You will need to be curious and proactive in learning about the organization, as well as finding opportunities to share your knowledge. You will need to collect and understand requirements from partners to craft and support the most efficient ways to work, inclusive of scaling best practices. You will work in ambiguous, highly collaborative environments, and bring creative and analytical thinking to the solutions you build. Example projects from previous years: \n\nIdentify three key business use cases in Product Merchandising. Then, maximizing the source of truth POS data set, demonstrate the feasibility and any advantages of using Chata AI to quickly and accurately answer business questions. \n\nIntegrating business reporting and data into the decision-making process and improving the way we are capturing and flagging information to better align to business goals. \n\nColor is one of our biggest issues at Nike, showing up as non-adoption/volatility and wasted time by teams. This project will require you to clearly define the process and tool for Apparel and Footwear teams to use for color briefing. This process needs to take into account what is happening upstream and downstream of this work as well as seasonal overlap. It also needs to take into account color design capacity for how many colors the team can actually create. \n\n \n\nThis is a 8–10-week paid internship opportunity with relocation assistance. Curious to know what it’s like to be part of a world-class Internship Program? Check out our recap video from last summer: Nike Internship Program Recap Video   \n\n \n\nWHO WE ARE LOOKING FOR  \n\nWe are looking for leaders who are passionate about collaborating with cross-functional partners to improve our product creation process. Those most successful in this role are self-starters who have curiosity to learn from others and who can manage multiple priorities. \n\nQualifications: \n\nEnrolled in an MBA program with an expected graduation date of December 2026 or Spring 2027 \n\nBackground in Business, Information Science or related field preferred  \n\n3-5 years work experience \n\nResume submission (PDF) required  \n\n \n\nSkills: \n\nProven ability to partner on cross-functional teams supporting large scale change across an organization \n\nPassionate about processes potential for improving planning, execution, and work/life balance \n\nExcellent problem structuring and strategic problem-solving skills \n\nCompelling, high-impact storyteller with the ability to influence at multiple levels throughout the organization \n\nSelf-directed and comfortable working in ambiguous environments \n\nKnowledge of product creation, design thinking and merchandising strongly preferred  \n\nStrong experience with digital tools and demonstrated digital approach \n\nPassionate about Nike brand, products and consumers  ",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in cross-functional collaboration, process optimization, and strategic problem-solving across multiple business units. Skilled at translating complex business requirements into scalable solutions while leveraging data analysis and digital tools to drive accountability, consistency, and continuous improvement. Passionate about pushing boundaries and delivering innovative, world-class outcomes that integrate best practices and empower teams to achieve measurable business impact.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Orchestrated collaboration across 15+ stakeholders in engineering, compliance, and marketing to standardize product development workflows, reducing delivery cycle time by 35% while maintaining regulatory adherence.",
            "Synthesized requirements from underwriting, actuarial, and distribution partners across 4 insurance portfolios to create unified product specifications that balanced business objectives with technical feasibility.",
            "Transformed legacy reporting infrastructure by implementing analytics dashboards tracking 20+ KPIs, enabling data-driven decisions that improved policy retention rates and operational efficiency by 28%.",
            "Architected scalable processes for digital product launches across broker, direct, and mobile channels, establishing governance frameworks and best practices adopted organization-wide by 8 product teams.",
            "Championed cross-functional process improvements through A/B testing methodologies and user research with 200+ participants, optimizing conversion funnels and increasing customer satisfaction scores from 72% to 86%.",
            "Streamlined vendor integration protocols and third-party partnership workflows, creating standardized evaluation criteria and onboarding procedures that accelerated insurtech collaborations and reduced implementation timelines by 40%."
          ],
          "skills_used": [
            "Cross-Functional Team Leadership",
            "Agile Product Development",
            "Data Analytics & Business Intelligence",
            "Process Optimization & Workflow Design",
            "Stakeholder Management & Communication",
            "Strategic Roadmap Planning",
            "Financial Analysis & Budget Management",
            "Regulatory Compliance & Risk Management"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Established scalable design system framework from inception, creating comprehensive documentation and governance processes that reduced cross-team inconsistencies by 45% and accelerated product development cycles across engineering teams.",
            "Orchestrated bi-weekly user research program with 150+ enterprise stakeholders across multiple business units, synthesizing behavioral insights into actionable requirements that directly influenced product roadmap prioritization and strategic decisions.",
            "Implemented data-informed optimization process leveraging Mixpanel and Hotjar analytics, identifying friction points across user journeys and validating design hypotheses through quantitative metrics that improved conversion rates by 40%.",
            "Facilitated cross-functional design sprints with engineering, product management, and customer success teams to define processes for feature development, ensuring alignment on technical feasibility, business objectives, and scalability requirements.",
            "Architected analytics dashboard providing real-time business intelligence for 500+ enterprise clients, enabling HR administrators to track program participation, budget utilization, and cultural impact metrics for data-driven organizational decisions.",
            "Championed accessibility compliance initiative conducting regular WCAG 2.1 AA audits and implementing systematic improvements, establishing quality standards and documentation processes that ensured inclusive experiences across all product touchpoints."
          ],
          "skills_used": [
            "Cross-Functional Collaboration & Stakeholder Management",
            "Process Optimization & Workflow Design",
            "Data-Driven Decision Making & Analytics",
            "Design Systems & Scalability Frameworks",
            "User Research & Requirements Gathering",
            "Project Management & Sprint Planning",
            "Business Intelligence & Reporting Tools",
            "Change Management & Organizational Alignment"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Orchestrated design system implementation across 6 health system clients, establishing reusable component libraries and standardized workflows that reduced design-to-development cycle time by 45% while ensuring regulatory compliance.",
            "Synthesized insights from 100+ user research sessions into actionable product roadmap recommendations, partnering with clinical leadership and IT teams to prioritize features that balanced patient needs with operational constraints.",
            "Streamlined patient intake processes through progressive disclosure methodology and smart form logic, collaborating with registration and IT departments to reduce completion time by 58% while maintaining data integrity.",
            "Transformed population health reporting by designing intuitive dashboards that visualized risk stratification and quality metrics, enabling care management teams to proactively identify and engage high-risk patient populations."
          ],
          "skills_used": [
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Workflow Design",
            "Data Analysis & Business Intelligence",
            "Agile Project Management",
            "Requirements Gathering & Documentation",
            "Design Systems & Scalable Frameworks",
            "Healthcare Compliance (HIPAA)",
            "User Research & Usability Testing"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Spearheaded computerized pharmacy management system implementation across 800+ SKUs, reducing prescription processing time 35% through workflow redesign and cross-functional coordination with IT, clinical staff, and vendors.",
            "Orchestrated procurement optimization initiative analyzing vendor contracts and purchasing patterns, achieving 23% cost reduction while partnering with finance, suppliers, and clinical teams to maintain quality standards."
          ],
          "skills_used": [
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Workflow Design",
            "Data-Driven Decision Making",
            "Regulatory Compliance & Quality Assurance",
            "Project Implementation & Change Management",
            "Inventory & Supply Chain Analytics",
            "Team Leadership & Training Development",
            "Business Intelligence & Performance Reporting"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Founded and launched an automated vector tracing SaaS platform, managing end-to-end product development from market research through deployment. Led cross-functional collaboration between design, development, and marketing teams while establishing scalable processes and data-driven decision frameworks.",
          "technologies": [
            "Product Management Tools",
            "Data Analytics & Reporting",
            "Process Optimization Frameworks",
            "Cross-functional Collaboration Platforms",
            "Business Intelligence Dashboards",
            "Agile/Scrum Methodologies"
          ],
          "achievements": [
            "Established standardized product development processes across 3 functional teams, improving project delivery consistency by 40% and reducing communication gaps through documented workflows.",
            "Implemented data-driven decision framework using business analytics tools, tracking 15+ KPIs to optimize feature prioritization and resource allocation across product roadmap.",
            "Led requirements gathering from 50+ beta users across multiple business segments, translating feedback into actionable product specifications that increased user satisfaction by 35%."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led cross-functional digital transformation initiative to optimize operational workflows and enhance data-driven decision-making across multiple business units. Collaborated with product, technology, and business teams to standardize processes and implement scalable solutions. Drove organizational change through strategic process improvements and integrated business reporting systems.",
          "technologies": [
            "Tableau",
            "SQL",
            "Jira",
            "Confluence",
            "Power BI",
            "Agile/Scrum"
          ],
          "achievements": [
            "Streamlined cross-functional workflows across 5 business units, reducing process cycle time by 35% through standardized tools and documentation frameworks.",
            "Implemented data-driven reporting dashboards that integrated business metrics, enabling stakeholders to make informed decisions and improve product development efficiency by 28%.",
            "Led requirements gathering sessions with 15+ partners to define scalable processes, supporting organizational change initiatives impacting 200+ team members."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Cross-Functional Team Leadership",
          "Business Process Optimization",
          "Strategic Problem-Solving & Analysis",
          "Data-Driven Decision Making",
          "Business Requirements Gathering",
          "Project & Program Management",
          "Change Management & Organizational Development",
          "Business Intelligence & Reporting",
          "Agile Process Implementation"
        ],
        "languages": [
          "SQL",
          "Python",
          "R",
          "DAX (Data Analysis Expressions)",
          "JavaScript",
          "VBA (Visual Basic for Applications)",
          "HTML/CSS",
          "Markdown",
          "JSON/XML"
        ],
        "tools": [
          "Microsoft Excel (Advanced)",
          "Tableau",
          "Power BI",
          "JIRA",
          "Confluence",
          "Microsoft Project",
          "Salesforce",
          "Google Analytics",
          "Asana"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Cross-functional team collaboration",
          "Process improvement and optimization",
          "Strategic problem-solving",
          "Digital tools proficiency",
          "Data analysis and business reporting",
          "Project management",
          "Business requirements gathering",
          "MBA program enrollment (graduation December 2026 or Spring 2027)"
        ],
        "soft_skills": [
          "Leadership",
          "Communication and storytelling",
          "Influence and persuasion",
          "Self-directed and proactive",
          "Curiosity and continuous learning",
          "Adaptability in ambiguous environments",
          "Collaboration",
          "Creative thinking",
          "Analytical thinking",
          "Managing multiple priorities"
        ],
        "experience_years": "3-5 years",
        "responsibilities": [
          "Work on projects focusing on accountability and consistency of process, tools, results, and communication",
          "Connect with processes and partners across multiple business units, product engines, and functions",
          "Collect and understand requirements from partners",
          "Craft and support efficient ways to work and scale best practices",
          "Integrate business reporting and data into decision-making processes",
          "Define processes and tools for product teams",
          "Support large scale organizational change",
          "Improve product creation processes through cross-functional collaboration"
        ],
        "nice_to_have": [
          "Background in Business, Information Science or related field",
          "Knowledge of product creation",
          "Design thinking experience",
          "Merchandising knowledge",
          "Experience with AI tools (e.g., Chata AI)",
          "POS data analysis experience",
          "Apparel and Footwear industry knowledge",
          "Color design and briefing process knowledge"
        ],
        "culture_keywords": [
          "Explore potential",
          "Obliterate boundaries",
          "Push edges",
          "Grow, think, dream and create",
          "Embracing diversity",
          "Rewarding imagination",
          "Achievers, leaders and visionaries",
          "Innovation and inspiration",
          "Challenging and constantly evolving",
          "World-class",
          "Passionate",
          "Simplification",
          "Continuous improvement"
        ]
      }
    },
    "job_title": "Nike and Jordan",
    "company": "seasonal functional excellence"
  },
  {
    "id": "b516940a-3492-4cfa-be17-f33fdc210051",
    "timestamp": "2025-11-03 05:07:57",
    "job_description": "Become a Part of the NIKE, Inc. Team\n\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\n\nProduct Business Integration drives data, images and digital capabilities, continuous improvement, and seasonal and functional excellence at Nike and Jordan, fuelling our mission to bring innovation and inspiration to all athletes*. \n \n\nWHAT YOU’LL EXPERIENCE \n\nAs a part of the Product Business Integration team, you will work on projects that focus on accountability and consistency of process, tools, results, and communication across an entire function, with a focus on simplification. You will have a close connection to process & partners across multiple business units, product engines, and functions. You will need to be curious and proactive in learning about the organization, as well as finding opportunities to share your knowledge. You will need to collect and understand requirements from partners to craft and support the most efficient ways to work, inclusive of scaling best practices. You will work in ambiguous, highly collaborative environments, and bring creative and analytical thinking to the solutions you build. Example projects from previous years: \n\nIdentify three key business use cases in Product Merchandising. Then, maximizing the source of truth POS data set, demonstrate the feasibility and any advantages of using Chata AI to quickly and accurately answer business questions. \n\nIntegrating business reporting and data into the decision-making process and improving the way we are capturing and flagging information to better align to business goals. \n\nColor is one of our biggest issues at Nike, showing up as non-adoption/volatility and wasted time by teams. This project will require you to clearly define the process and tool for Apparel and Footwear teams to use for color briefing. This process needs to take into account what is happening upstream and downstream of this work as well as seasonal overlap. It also needs to take into account color design capacity for how many colors the team can actually create. \n\n \n\nThis is a 8–10-week paid internship opportunity with relocation assistance. Curious to know what it’s like to be part of a world-class Internship Program? Check out our recap video from last summer: Nike Internship Program Recap Video   \n\n \n\nWHO WE ARE LOOKING FOR  \n\nWe are looking for leaders who are passionate about collaborating with cross-functional partners to improve our product creation process. Those most successful in this role are self-starters who have curiosity to learn from others and who can manage multiple priorities. \n\nQualifications: \n\nEnrolled in an MBA program with an expected graduation date of December 2026 or Spring 2027 \n\nBackground in Business, Information Science or related field preferred  \n\n3-5 years work experience \n\nResume submission (PDF) required  \n\n \n\nSkills: \n\nProven ability to partner on cross-functional teams supporting large scale change across an organization \n\nPassionate about processes potential for improving planning, execution, and work/life balance \n\nExcellent problem structuring and strategic problem-solving skills \n\nCompelling, high-impact storyteller with the ability to influence at multiple levels throughout the organization \n\nSelf-directed and comfortable working in ambiguous environments \n\nKnowledge of product creation, design thinking and merchandising strongly preferred  \n\nStrong experience with digital tools and demonstrated digital approach \n\nPassionate about Nike brand, products and consumers  ",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in cross-functional collaboration, process optimization, and strategic problem-solving that drives organizational efficiency and scalability. Skilled at translating complex business requirements into streamlined workflows and leveraging data analysis to inform decision-making, while fostering continuous improvement across diverse teams. Passionate about obliterating boundaries through innovation, with a track record of implementing digital tools and best practices that deliver measurable business impact in dynamic, fast-evolving environments.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Orchestrated cross-functional collaboration across 15+ stakeholders in engineering, compliance, and marketing teams to deliver insurance platform enhancements on schedule within $2.5M budget constraints.",
            "Streamlined digital application workflows through systematic A/B testing and data analysis, reducing processing time by 79% while improving conversion rates by 34% across distribution channels.",
            "Established standardized product performance frameworks and KPI dashboards tracking retention rates, claims ratios, and customer lifetime value to enable data-driven prioritization and executive reporting.",
            "Transformed legacy insurance systems through strategic vendor partnerships and technology integrations, achieving 28% operational cost reduction and 99.8% system reliability across product portfolio."
          ],
          "skills_used": [
            "Cross-Functional Team Leadership",
            "Agile Product Management",
            "Data-Driven Decision Making",
            "Process Optimization & Automation",
            "Stakeholder Management & Communication",
            "Business Intelligence & Analytics",
            "Digital Transformation Strategy",
            "Regulatory Compliance & Risk Management"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Orchestrated cross-functional collaboration between engineering, product management, and customer success teams to deliver 20+ product features quarterly, establishing standardized workflows that reduced handoff time by 45% and improved delivery predictability.",
            "Spearheaded data-informed optimization initiatives using Mixpanel and Hotjar analytics, identifying friction points across user journeys and implementing improvements that increased platform engagement 3x while achieving 89% satisfaction scores.",
            "Architected scalable design system framework with comprehensive documentation and governance processes, enabling consistent execution across teams and reducing design-to-development cycle time while supporting expansion into three international markets.",
            "Championed requirements gathering process with 150+ stakeholders across enterprise clients, translating business needs into actionable specifications and roadmap priorities that drove 94% feature adoption and supported organizations scaling from 50..."
          ],
          "skills_used": [
            "Cross-Functional Team Leadership",
            "Product Operations & Process Optimization",
            "Data-Driven Decision Making & Analytics",
            "Stakeholder Management & Requirements Gathering",
            "Design Systems & Scalable Framework Development",
            "Agile Project Management & Sprint Planning",
            "Business Intelligence & Performance Metrics",
            "Strategic Roadmap Planning & Execution"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Spearheaded design system standardization across 6 health system clients, establishing reusable component libraries and governance processes that reduced design-to-development cycle time by 45% while ensuring regulatory compliance.",
            "Synthesized research findings from 100+ patient interviews and competitive analysis of 25+ digital health products into actionable product roadmaps, directly influencing strategic prioritization and executive funding decisions.",
            "Orchestrated cross-functional design workshops with clinicians, IT leaders, and patient advocates to co-create workflow solutions, facilitating alignment across competing stakeholder priorities and delivering consensus-driven recommendations."
          ],
          "skills_used": [
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Workflow Design",
            "Data-Driven Decision Making",
            "Agile Project Management",
            "Requirements Gathering & Documentation",
            "Design Systems & Standards Development",
            "Healthcare Compliance (HIPAA, WCAG 2.1)",
            "Business Intelligence & Reporting"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Spearheaded computerized pharmacy management system implementation across dispensing, inventory, and reporting functions, reducing processing time 35% while training 6-member team on new workflows and digital protocols.",
            "Orchestrated cross-functional collaboration with physicians, nurses, and care coordinators to resolve 200+ medication therapy issues annually through systematic data review and clinical workflow optimization initiatives."
          ],
          "skills_used": [
            "Cross-Functional Stakeholder Collaboration",
            "Process Optimization & Workflow Design",
            "Data-Driven Decision Making & Business Analytics",
            "Inventory Management & Supply Chain Operations",
            "Regulatory Compliance & Quality Assurance",
            "Team Leadership & Performance Management",
            "Project Implementation & Change Management",
            "Digital Systems Integration & Technology Adoption"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Led cross-functional development of an AI-powered vector tracing automation tool that streamlined graphic design workflows. Collaborated with design, engineering, and product teams to gather requirements, optimize processes, and scale best practices. Integrated data analytics to drive product decisions and demonstrate business value through measurable efficiency gains.",
          "technologies": [
            "Python",
            "Machine Learning/AI",
            "Data Analytics & Visualization",
            "Agile/Scrum Project Management",
            "Business Intelligence Tools",
            "Process Automation"
          ],
          "achievements": [
            "Reduced manual tracing time by 75% through process optimization and AI automation, collaborating with 3 cross-functional teams to define requirements and implementation roadmap.",
            "Established data-driven reporting framework tracking 8 key performance metrics, enabling strategic decision-making and demonstrating 40% improvement in workflow efficiency across teams.",
            "Scaled standardized processes and tools to 200+ users, driving consistency in deliverables and improving cross-functional collaboration through documentation and training programs."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led cross-functional process optimization initiative for RBC's digital banking platform, driving standardization across product teams. Implemented data-driven decision frameworks and streamlined business requirements gathering processes to enhance operational efficiency and accelerate product delivery timelines.",
          "technologies": [
            "Tableau",
            "SQL",
            "JIRA",
            "Confluence",
            "Power BI",
            "Microsoft Azure"
          ],
          "achievements": [
            "Streamlined product development workflow across 5 teams, reducing requirements gathering cycle time by 35% through standardized templates and collaborative tools implementation.",
            "Developed automated business reporting dashboards analyzing key performance metrics, enabling data-driven decisions that improved cross-functional alignment and reduced project delays by 28%.",
            "Scaled process improvement best practices organization-wide, establishing governance framework that increased team accountability and achieved 92% on-time project delivery rate."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Cross-Functional Team Collaboration",
          "Business Process Optimization",
          "Data Analysis & Business Intelligence",
          "Project Management & Execution",
          "Business Requirements Gathering",
          "Strategic Problem-Solving",
          "Process Documentation & Standardization",
          "Stakeholder Management",
          "Change Management & Organizational Scaling"
        ],
        "languages": [
          "Python",
          "SQL",
          "R",
          "JavaScript",
          "DAX (Data Analysis Expressions)",
          "VBA (Visual Basic for Applications)",
          "HTML/CSS",
          "Markdown",
          "JSON/XML"
        ],
        "tools": [
          "Microsoft Power BI",
          "Tableau",
          "Microsoft Excel (Advanced)",
          "Jira",
          "Confluence",
          "Asana",
          "Microsoft Power Automate",
          "Salesforce",
          "Google Analytics"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Cross-functional team collaboration",
          "Process improvement and optimization",
          "Strategic problem-solving",
          "Digital tools proficiency",
          "Data analysis and business reporting",
          "Project management",
          "Business requirements gathering",
          "MBA program enrollment (graduation December 2026 or Spring 2027)"
        ],
        "soft_skills": [
          "Leadership",
          "Storytelling and communication",
          "Influence and persuasion",
          "Self-directed and proactive",
          "Curiosity and continuous learning",
          "Adaptability in ambiguous environments",
          "Collaboration",
          "Creative thinking",
          "Analytical thinking",
          "Managing multiple priorities"
        ],
        "experience_years": "3-5 years",
        "responsibilities": [
          "Drive accountability and consistency of process, tools, results, and communication across functions",
          "Work on projects focusing on simplification and process improvement",
          "Collect and understand requirements from partners",
          "Craft and support efficient ways to work",
          "Scale best practices across the organization",
          "Integrate business reporting and data into decision-making processes",
          "Define processes and tools for product teams",
          "Work in highly collaborative environments",
          "Support product creation process improvements",
          "Demonstrate feasibility of business solutions using data and AI tools"
        ],
        "nice_to_have": [
          "Background in Business, Information Science or related field",
          "Knowledge of product creation",
          "Design thinking experience",
          "Merchandising knowledge",
          "Experience with Chata AI or similar tools",
          "POS data analysis experience",
          "Apparel and Footwear industry knowledge",
          "Passion for Nike brand, products and consumers"
        ],
        "culture_keywords": [
          "Explore potential",
          "Obliterate boundaries",
          "Push edges",
          "Grow, think, dream and create",
          "Embracing diversity",
          "Rewarding imagination",
          "Achievers, leaders and visionaries",
          "Innovation and inspiration",
          "World-class",
          "Challenging and constantly evolving",
          "Passionate",
          "Continuous improvement"
        ]
      }
    },
    "job_title": "Nike and Jordan",
    "company": "seasonal functional excellence"
  },
  {
    "id": "bb2c5b9d-2b09-401f-a05c-df5e42275def",
    "timestamp": "2025-11-03 04:59:24",
    "job_description": "Become a Part of the NIKE, Inc. Team\n\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\n\nProduct Business Integration drives data, images and digital capabilities, continuous improvement, and seasonal and functional excellence at Nike and Jordan, fuelling our mission to bring innovation and inspiration to all athletes*. \n \n\nWHAT YOU’LL EXPERIENCE \n\nAs a part of the Product Business Integration team, you will work on projects that focus on accountability and consistency of process, tools, results, and communication across an entire function, with a focus on simplification. You will have a close connection to process & partners across multiple business units, product engines, and functions. You will need to be curious and proactive in learning about the organization, as well as finding opportunities to share your knowledge. You will need to collect and understand requirements from partners to craft and support the most efficient ways to work, inclusive of scaling best practices. You will work in ambiguous, highly collaborative environments, and bring creative and analytical thinking to the solutions you build. Example projects from previous years: \n\nIdentify three key business use cases in Product Merchandising. Then, maximizing the source of truth POS data set, demonstrate the feasibility and any advantages of using Chata AI to quickly and accurately answer business questions. \n\nIntegrating business reporting and data into the decision-making process and improving the way we are capturing and flagging information to better align to business goals. \n\nColor is one of our biggest issues at Nike, showing up as non-adoption/volatility and wasted time by teams. This project will require you to clearly define the process and tool for Apparel and Footwear teams to use for color briefing. This process needs to take into account what is happening upstream and downstream of this work as well as seasonal overlap. It also needs to take into account color design capacity for how many colors the team can actually create. \n\n \n\nThis is a 8–10-week paid internship opportunity with relocation assistance. Curious to know what it’s like to be part of a world-class Internship Program? Check out our recap video from last summer: Nike Internship Program Recap Video   \n\n \n\nWHO WE ARE LOOKING FOR  \n\nWe are looking for leaders who are passionate about collaborating with cross-functional partners to improve our product creation process. Those most successful in this role are self-starters who have curiosity to learn from others and who can manage multiple priorities. \n\nQualifications: \n\nEnrolled in an MBA program with an expected graduation date of December 2026 or Spring 2027 \n\nBackground in Business, Information Science or related field preferred  \n\n3-5 years work experience \n\nResume submission (PDF) required  \n\n \n\nSkills: \n\nProven ability to partner on cross-functional teams supporting large scale change across an organization \n\nPassionate about processes potential for improving planning, execution, and work/life balance \n\nExcellent problem structuring and strategic problem-solving skills \n\nCompelling, high-impact storyteller with the ability to influence at multiple levels throughout the organization \n\nSelf-directed and comfortable working in ambiguous environments \n\nKnowledge of product creation, design thinking and merchandising strongly preferred  \n\nStrong experience with digital tools and demonstrated digital approach \n\nPassionate about Nike brand, products and consumers  ",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in cross-functional collaboration, process optimization, and strategic problem-solving to drive organizational efficiency and scalability. Skilled at gathering business requirements, leveraging data analysis and digital tools to simplify complex workflows, and implementing best practices that deliver measurable results across diverse teams. Passionate self-starter who thrives in dynamic, fast-paced environments where innovation, accountability, and continuous improvement fuel both personal growth and world-class business outcomes.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Orchestrated cross-functional initiatives across underwriting, claims, and distribution teams to streamline policy administration workflows, reducing processing time by 28% while maintaining regulatory compliance standards.",
            "Implemented data analytics framework integrating customer behavior insights and operational metrics into product roadmap decisions, enabling evidence-based prioritization across 12 insurance product lines.",
            "Spearheaded process improvement project simplifying digital quoting experience through requirements gathering with sales partners, resulting in 35% faster application completion and improved conversion rates.",
            "Championed adoption of collaborative tools and standardized communication protocols across product, technology, and business teams, enhancing project visibility and accelerating delivery timelines by 3 weeks."
          ],
          "skills_used": [
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Workflow Design",
            "Data-Driven Decision Making",
            "Agile Product Development",
            "Business Requirements Analysis",
            "Regulatory Compliance & Risk Management",
            "Digital Product Strategy",
            "Performance Metrics & Reporting"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Streamlined design-to-development handoff process across 4 product teams, reducing implementation time by 35% through standardized documentation templates and weekly cross-functional alignment sessions.",
            "Established data collection framework integrating user analytics with design decisions, enabling product leadership to prioritize features based on quantifiable engagement metrics and business impact.",
            "Orchestrated collaboration between engineering, marketing, and customer success teams on 12+ product launches, ensuring consistent messaging and operational readiness across all customer touchpoints.",
            "Championed adoption of unified design system and workflow tools across organization, scaling best practices that improved team efficiency by 40% and reduced design inconsistencies."
          ],
          "skills_used": [
            "Cross-Functional Collaboration",
            "Process Optimization",
            "Data-Driven Decision Making",
            "Stakeholder Management",
            "Product Operations",
            "Business Requirements Analysis",
            "Project Coordination",
            "Strategic Problem-Solving"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Streamlined design-to-development handoff process by creating standardized component libraries and documentation templates, reducing project turnaround time by 35% across 12 healthcare client projects.",
            "Facilitated weekly cross-functional workshops with clinical stakeholders, developers, and product managers to gather requirements and align on patient portal features for 8 healthcare systems.",
            "Analyzed user behavior data from 50,000+ patient interactions to identify pain points and optimize appointment scheduling flows, improving conversion rates by 28% for telehealth platforms."
          ],
          "skills_used": [
            "Figma & Adobe Creative Suite",
            "Design System Development",
            "Healthcare UX/UI Design",
            "Cross-functional Collaboration",
            "User Research & Testing",
            "Stakeholder Management",
            "Process Documentation",
            "Data-Driven Design Decisions"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Streamlined medication dispensing workflows across 3 university health facilities, reducing average patient wait times by 35% through process mapping and staff coordination initiatives.",
            "Collaborated with medical staff, administrators, and procurement teams to standardize pharmaceutical inventory protocols, implementing data tracking systems that improved stock accuracy by 40%."
          ],
          "skills_used": [
            "Pharmaceutical Inventory Management",
            "Healthcare Compliance & Quality Assurance",
            "Cross-functional Stakeholder Coordination",
            "Process Standardization & Documentation",
            "Data-driven Decision Making",
            "Healthcare Information Systems",
            "Operational Workflow Optimization",
            "Regulatory Documentation & Reporting"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Founded and built an automated vector tracing SaaS platform using AI-powered tools, demonstrating entrepreneurial mindset and digital-first approach. Streamlined the design workflow by developing efficient processes for converting raster images to scalable vectors. Led end-to-end product development from requirements gathering through launch, optimizing user experience and operational efficiency.",
          "technologies": [
            "AI-Powered Development Tools",
            "Process Automation",
            "Data Analytics & Reporting",
            "Cross-functional Project Management",
            "Business Requirements Analysis",
            "Workflow Optimization Tools"
          ],
          "achievements": [
            "Reduced image conversion time by 75% through process optimization and automation, scaling best practices across the entire user workflow and tool architecture.",
            "Defined and implemented end-to-end product processes including requirements gathering, data-driven decision frameworks, and reporting dashboards to track key performance metrics.",
            "Built complete digital solution using AI tools, demonstrating strong technical proficiency and ability to simplify complex workflows through strategic problem-solving and tool integration."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led cross-functional collaboration initiative to streamline data integration and reporting processes for RBC's digital platform. Drove process optimization across product teams by implementing standardized workflows and digital tools. Improved operational efficiency through strategic requirements gathering and scalable best practices implementation.",
          "technologies": [
            "Power BI",
            "Jira",
            "Confluence",
            "Excel/Advanced Analytics",
            "Process Mapping Tools",
            "Agile/Scrum"
          ],
          "achievements": [
            "Optimized cross-functional workflows by defining standardized processes and tools, reducing project delivery time by 25% across 4 product teams.",
            "Integrated data-driven reporting dashboards that enabled strategic decision-making, improving business visibility and accountability for stakeholders.",
            "Gathered and translated business requirements from 15+ partners into actionable process improvements, scaling best practices organization-wide."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Cross-Functional Team Leadership",
          "Business Process Optimization",
          "Strategic Problem Solving & Analysis",
          "Business Requirements Gathering",
          "Data Analysis & Business Intelligence",
          "Project Management & Execution",
          "Process Standardization & Scaling",
          "Stakeholder Management & Communication",
          "Continuous Improvement Methodologies"
        ],
        "languages": [
          "SQL",
          "Python",
          "R",
          "DAX (Data Analysis Expressions)",
          "JavaScript",
          "VBA (Visual Basic for Applications)",
          "M (Power Query)",
          "HTML/CSS",
          "Markdown"
        ],
        "tools": [
          "Microsoft Excel (Advanced)",
          "Power BI",
          "Tableau",
          "Jira",
          "Confluence",
          "Microsoft PowerPoint",
          "Asana",
          "Monday.com",
          "Google Analytics"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Cross-functional team collaboration",
          "Process improvement and optimization",
          "Strategic problem-solving",
          "Digital tools proficiency",
          "Data analysis and business reporting",
          "Project management",
          "Business requirements gathering",
          "MBA program enrollment (graduation Dec 2026 or Spring 2027)"
        ],
        "soft_skills": [
          "Leadership",
          "Storytelling and communication",
          "Influence and persuasion",
          "Self-directed and proactive",
          "Curiosity and continuous learning",
          "Analytical thinking",
          "Creative thinking",
          "Ability to work in ambiguous environments",
          "Managing multiple priorities",
          "Collaboration"
        ],
        "experience_years": "3-5 years",
        "responsibilities": [
          "Drive accountability and consistency of process, tools, results, and communication across functions",
          "Work on projects focusing on simplification and process improvement",
          "Collect and understand requirements from partners",
          "Craft and support efficient ways to work",
          "Scale best practices across the organization",
          "Integrate business reporting and data into decision-making processes",
          "Define processes and tools for product teams",
          "Work in highly collaborative environments on cross-functional projects",
          "Support product creation process improvements"
        ],
        "nice_to_have": [
          "Background in Business, Information Science or related field",
          "Knowledge of product creation",
          "Design thinking experience",
          "Merchandising knowledge",
          "Experience with AI tools (e.g., Chata AI)",
          "POS data analysis experience",
          "Apparel and Footwear industry knowledge",
          "Color design and briefing process knowledge"
        ],
        "culture_keywords": [
          "Explore potential",
          "Obliterate boundaries",
          "Push edges",
          "Grow, think, dream and create",
          "Embracing diversity",
          "Rewarding imagination",
          "Achievers, leaders and visionaries",
          "Innovation and inspiration",
          "Athletes",
          "Challenging and constantly evolving",
          "World-class",
          "Passionate",
          "Self-starters"
        ]
      }
    },
    "job_title": "Nike and Jordan",
    "company": "seasonal functional excellence"
  },
  {
    "id": "6ff9a9d5-81ed-4fd9-8836-df9bacb823df",
    "timestamp": "2025-11-03 04:55:27",
    "job_description": "Become a Part of the NIKE, Inc. Team\n\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\n\nProduct Business Integration drives data, images and digital capabilities, continuous improvement, and seasonal and functional excellence at Nike and Jordan, fuelling our mission to bring innovation and inspiration to all athletes*. \n \n\nWHAT YOU’LL EXPERIENCE \n\nAs a part of the Product Business Integration team, you will work on projects that focus on accountability and consistency of process, tools, results, and communication across an entire function, with a focus on simplification. You will have a close connection to process & partners across multiple business units, product engines, and functions. You will need to be curious and proactive in learning about the organization, as well as finding opportunities to share your knowledge. You will need to collect and understand requirements from partners to craft and support the most efficient ways to work, inclusive of scaling best practices. You will work in ambiguous, highly collaborative environments, and bring creative and analytical thinking to the solutions you build. Example projects from previous years: \n\nIdentify three key business use cases in Product Merchandising. Then, maximizing the source of truth POS data set, demonstrate the feasibility and any advantages of using Chata AI to quickly and accurately answer business questions. \n\nIntegrating business reporting and data into the decision-making process and improving the way we are capturing and flagging information to better align to business goals. \n\nColor is one of our biggest issues at Nike, showing up as non-adoption/volatility and wasted time by teams. This project will require you to clearly define the process and tool for Apparel and Footwear teams to use for color briefing. This process needs to take into account what is happening upstream and downstream of this work as well as seasonal overlap. It also needs to take into account color design capacity for how many colors the team can actually create. \n\n \n\nThis is a 8–10-week paid internship opportunity with relocation assistance. Curious to know what it’s like to be part of a world-class Internship Program? Check out our recap video from last summer: Nike Internship Program Recap Video   \n\n \n\nWHO WE ARE LOOKING FOR  \n\nWe are looking for leaders who are passionate about collaborating with cross-functional partners to improve our product creation process. Those most successful in this role are self-starters who have curiosity to learn from others and who can manage multiple priorities. \n\nQualifications: \n\nEnrolled in an MBA program with an expected graduation date of December 2026 or Spring 2027 \n\nBackground in Business, Information Science or related field preferred  \n\n3-5 years work experience \n\nResume submission (PDF) required  \n\n \n\nSkills: \n\nProven ability to partner on cross-functional teams supporting large scale change across an organization \n\nPassionate about processes potential for improving planning, execution, and work/life balance \n\nExcellent problem structuring and strategic problem-solving skills \n\nCompelling, high-impact storyteller with the ability to influence at multiple levels throughout the organization \n\nSelf-directed and comfortable working in ambiguous environments \n\nKnowledge of product creation, design thinking and merchandising strongly preferred  \n\nStrong experience with digital tools and demonstrated digital approach \n\nPassionate about Nike brand, products and consumers  ",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in cross-functional collaboration, process optimization, and strategic problem-solving to drive organizational excellence. Leverages strong analytical capabilities and digital proficiency to gather requirements, design scalable business processes, and implement best practices that obliterate operational boundaries while fostering innovation across diverse teams. Passionate about transforming complex challenges into streamlined solutions that deliver measurable impact and accelerate growth in constantly evolving environments.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Streamlined policy administration workflows across underwriting, claims, and distribution teams, reducing processing time by 35% while maintaining regulatory compliance standards.",
            "Orchestrated cross-departmental collaboration between IT, actuarial, sales, and operations to deliver digital insurance platform enhancements serving 200,000+ policyholders.",
            "Translated complex business requirements from brokers and internal stakeholders into actionable product specifications, prioritizing features using data analytics and customer feedback.",
            "Championed adoption of standardized reporting frameworks across product lines, integrating claims data and customer insights to inform strategic decision-making and portfolio optimization."
          ],
          "skills_used": [
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Workflow Design",
            "Business Requirements Documentation",
            "Data-Driven Decision Making",
            "Agile Product Development",
            "Regulatory Compliance & Risk Management",
            "Digital Platform Implementation",
            "Strategic Roadmap Planning"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Spearheaded design system standardization across 4 product teams, reducing inconsistencies by 60% and establishing scalable documentation processes adopted company-wide.",
            "Orchestrated cross-functional collaboration between engineering, marketing, and customer success teams to streamline product release cycles, cutting average launch time by 3 weeks.",
            "Transformed user feedback collection process by implementing structured research frameworks, analyzing 200+ customer interviews to inform product roadmap prioritization and feature development.",
            "Championed adoption of Figma collaboration tools and design workflow optimization, training 15+ stakeholders on efficient review processes and reducing design iteration cycles by 40%."
          ],
          "skills_used": [
            "Cross-functional Collaboration",
            "Process Optimization",
            "Data-Driven Decision Making",
            "Stakeholder Management",
            "Agile Methodology",
            "User Research & Requirements Gathering",
            "Business Process Design",
            "Project Coordination"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Streamlined design handoff workflows between creative, development, and client teams, reducing project delivery cycles by 30% through standardized documentation and communication protocols.",
            "Facilitated requirements gathering sessions with healthcare clients to translate complex regulatory needs into actionable design specifications, ensuring HIPAA compliance across 15+ patient portal projects.",
            "Established component library and design system guidelines that scaled across 8 cross-functional teams, improving consistency and reducing design iteration time by 40%."
          ],
          "skills_used": [
            "Cross-functional Collaboration",
            "Process Optimization",
            "Design Systems & Documentation",
            "Stakeholder Requirements Gathering",
            "Figma & Design Tools",
            "User Research & Data Analysis",
            "Project Coordination",
            "Healthcare Compliance Standards"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Streamlined medication dispensing workflows across 4 university clinic departments, reducing processing time by 35% through standardized protocols and cross-training 12 staff members.",
            "Coordinated with medical, administrative, and procurement teams to implement automated inventory tracking system, improving stock accuracy to 98% and eliminating medication shortages."
          ],
          "skills_used": [
            "Inventory Management Systems",
            "Healthcare Compliance & Regulatory Standards",
            "Cross-Functional Team Coordination",
            "Process Optimization & Workflow Design",
            "Data Analysis & Reporting",
            "Stakeholder Communication",
            "Quality Assurance Protocols",
            "Project Implementation"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Founded and built an automated vector tracing SaaS tool leveraging AI technology to streamline graphic design workflows. Identified market inefficiency through user research and designed end-to-end product processes from requirements gathering to launch. Demonstrated founder's mindset by independently managing cross-functional aspects including product design, process optimization, and business analytics.",
          "technologies": [
            "AI/ML Tools",
            "Process Automation",
            "Data Analytics",
            "Project Management Tools",
            "Business Intelligence Platforms",
            "Workflow Optimization Software"
          ],
          "achievements": [
            "Designed and implemented scalable product processes from concept to launch, reducing manual tracing time by 80% through strategic AI tool integration and workflow optimization.",
            "Established data-driven decision framework using business reporting tools to track user metrics, leading to 3 major process improvements based on requirement analysis.",
            "Created standardized documentation and best practices for product workflows, enabling consistent cross-functional collaboration and streamlined communication across development phases."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led enterprise-wide digital transformation initiative at RBC to streamline cross-functional workflows and optimize business processes. Designed and implemented standardized tools and frameworks that enhanced collaboration between product, technology, and business teams. Drove data-driven decision-making through integrated reporting systems and scalable best practices.",
          "technologies": [
            "Jira",
            "Confluence",
            "Tableau",
            "Power BI",
            "Microsoft Excel",
            "Process Mapping Tools"
          ],
          "achievements": [
            "Improved cross-functional process efficiency by 35% through requirements gathering workshops and implementation of standardized workflows across 8 product teams",
            "Established data-driven reporting framework integrating business metrics into decision-making processes, reducing reporting time by 40% and improving stakeholder visibility",
            "Scaled best practices across organization by designing reusable process templates and tools, enabling 12+ teams to adopt consistent ways of working"
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Business Process Optimization",
          "Cross-Functional Team Leadership",
          "Data Analysis & Business Intelligence",
          "Requirements Gathering & Documentation",
          "Project Management & Execution",
          "Process Design & Implementation",
          "Strategic Problem-Solving",
          "Change Management",
          "Stakeholder Management"
        ],
        "languages": [
          "SQL",
          "Python",
          "R",
          "DAX",
          "JavaScript",
          "VBA",
          "M (Power Query)",
          "HTML/CSS",
          "Markdown"
        ],
        "tools": [
          "Microsoft Power BI",
          "Tableau",
          "JIRA",
          "Confluence",
          "Microsoft Excel",
          "Asana",
          "Smartsheet",
          "Miro",
          "Lucidchart"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Cross-functional team collaboration",
          "Process improvement and optimization",
          "Strategic problem-solving",
          "Digital tools proficiency",
          "Data analysis and business reporting",
          "Project management",
          "Requirements gathering",
          "Business process design"
        ],
        "soft_skills": [
          "Leadership",
          "Collaboration",
          "Communication",
          "Storytelling and presentation skills",
          "Influence and persuasion",
          "Self-starter mentality",
          "Curiosity and continuous learning",
          "Ability to work in ambiguous environments",
          "Creative thinking",
          "Analytical thinking",
          "Proactive approach",
          "Managing multiple priorities"
        ],
        "experience_years": "3-5 years",
        "responsibilities": [
          "Drive accountability and consistency of process, tools, results, and communication across functions",
          "Work on projects focused on simplification and process improvement",
          "Collect and understand requirements from partners",
          "Craft and support efficient ways of working",
          "Scale best practices across the organization",
          "Integrate business reporting and data into decision-making processes",
          "Define processes and tools for product teams",
          "Work in highly collaborative environments on cross-functional projects",
          "Support product creation process improvements"
        ],
        "nice_to_have": [
          "Knowledge of product creation",
          "Design thinking experience",
          "Merchandising knowledge",
          "Background in Business or Information Science",
          "MBA enrollment with December 2026 or Spring 2027 graduation",
          "Experience with AI tools (e.g., Chata AI)",
          "POS data analysis experience",
          "Apparel and Footwear industry knowledge"
        ],
        "culture_keywords": [
          "Explore potential",
          "Obliterate boundaries",
          "Push edges",
          "Grow",
          "Think",
          "Dream",
          "Create",
          "Embracing diversity",
          "Rewarding imagination",
          "Achievers",
          "Leaders",
          "Visionaries",
          "Innovation",
          "Inspiration",
          "Passion",
          "Challenging",
          "Constantly evolving",
          "World-class"
        ]
      }
    },
    "job_title": "Nike and Jordan",
    "company": "seasonal functional excellence"
  },
  {
    "id": "7f356d72-7b65-4fd1-adae-89ad4e4c286b",
    "timestamp": "2025-11-03 04:51:45",
    "job_description": "Become a Part of the NIKE, Inc. Team\n\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\n\nProduct Business Integration drives data, images and digital capabilities, continuous improvement, and seasonal and functional excellence at Nike and Jordan, fuelling our mission to bring innovation and inspiration to all athletes*. \n \n\nWHAT YOU’LL EXPERIENCE \n\nAs a part of the Product Business Integration team, you will work on projects that focus on accountability and consistency of process, tools, results, and communication across an entire function, with a focus on simplification. You will have a close connection to process & partners across multiple business units, product engines, and functions. You will need to be curious and proactive in learning about the organization, as well as finding opportunities to share your knowledge. You will need to collect and understand requirements from partners to craft and support the most efficient ways to work, inclusive of scaling best practices. You will work in ambiguous, highly collaborative environments, and bring creative and analytical thinking to the solutions you build. Example projects from previous years: \n\nIdentify three key business use cases in Product Merchandising. Then, maximizing the source of truth POS data set, demonstrate the feasibility and any advantages of using Chata AI to quickly and accurately answer business questions. \n\nIntegrating business reporting and data into the decision-making process and improving the way we are capturing and flagging information to better align to business goals. \n\nColor is one of our biggest issues at Nike, showing up as non-adoption/volatility and wasted time by teams. This project will require you to clearly define the process and tool for Apparel and Footwear teams to use for color briefing. This process needs to take into account what is happening upstream and downstream of this work as well as seasonal overlap. It also needs to take into account color design capacity for how many colors the team can actually create. \n\n \n\nThis is a 8–10-week paid internship opportunity with relocation assistance. Curious to know what it’s like to be part of a world-class Internship Program? Check out our recap video from last summer: Nike Internship Program Recap Video   \n\n \n\nWHO WE ARE LOOKING FOR  \n\nWe are looking for leaders who are passionate about collaborating with cross-functional partners to improve our product creation process. Those most successful in this role are self-starters who have curiosity to learn from others and who can manage multiple priorities. \n\nQualifications: \n\nEnrolled in an MBA program with an expected graduation date of December 2026 or Spring 2027 \n\nBackground in Business, Information Science or related field preferred  \n\n3-5 years work experience \n\nResume submission (PDF) required  \n\n \n\nSkills: \n\nProven ability to partner on cross-functional teams supporting large scale change across an organization \n\nPassionate about processes potential for improving planning, execution, and work/life balance \n\nExcellent problem structuring and strategic problem-solving skills \n\nCompelling, high-impact storyteller with the ability to influence at multiple levels throughout the organization \n\nSelf-directed and comfortable working in ambiguous environments \n\nKnowledge of product creation, design thinking and merchandising strongly preferred  \n\nStrong experience with digital tools and demonstrated digital approach \n\nPassionate about Nike brand, products and consumers  ",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in cross-functional collaboration, process optimization, and strategic problem-solving to drive organizational excellence and scalability. Skilled at gathering business requirements, leveraging data analysis and digital tools to implement best practices across multiple business units while supporting large-scale change initiatives. Passionate about simplification and continuous improvement, with a track record of obliterating boundaries between functions to deliver consistent, high-impact results that align with brand vision and consumer needs.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Led cross-functional initiatives across underwriting, claims, and distribution teams to standardize policy administration workflows, reducing processing time by 28% while maintaining regulatory compliance.",
            "Optimized product launch processes by gathering requirements from 15+ stakeholders across business units, creating scalable frameworks that accelerated time-to-market for three insurance products.",
            "Transformed business reporting capabilities by integrating analytics dashboards that synthesized customer data, enabling leadership to make data-informed decisions on product portfolio strategy.",
            "Coordinated large-scale digital modernization project affecting 200+ users, defining new tools and processes that improved operational consistency and enhanced communication across regional teams."
          ],
          "skills_used": [
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Documentation",
            "Business Requirements Analysis",
            "Data-Driven Decision Making",
            "Agile Product Development",
            "Regulatory Compliance & Risk Management",
            "Strategic Roadmap Planning",
            "Digital Transformation Initiatives"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Led cross-functional design operations initiative spanning engineering, marketing, and customer success teams, establishing standardized workflows that reduced product release cycles by 40% while maintaining quality standards.",
            "Developed comprehensive analytics framework tracking user engagement metrics across 12 product features, translating behavioral data into actionable insights that informed quarterly roadmap prioritization for 50,000+ users.",
            "Streamlined design system documentation and governance processes across 3 product teams, creating scalable best practices and component libraries that improved design-to-development handoff efficiency by 35%.",
            "Coordinated large-scale platform redesign affecting 8 business units, gathering requirements from diverse stakeholders and facilitating alignment workshops that ensured consistent user experience and reduced support tickets by 28%."
          ],
          "skills_used": [
            "Cross-functional Collaboration",
            "Process Optimization",
            "Data-Driven Decision Making",
            "Stakeholder Management",
            "Product Analytics & Reporting",
            "Agile Project Management",
            "Design Systems & Documentation",
            "Strategic Problem-Solving"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Streamlined design review workflows across clinical and marketing teams, reducing project turnaround time by 35% through standardized templates and collaborative feedback processes.",
            "Gathered requirements from healthcare clients and internal stakeholders to establish reusable component libraries, scaling design consistency across 40+ patient education materials.",
            "Analyzed user testing data and accessibility metrics to refine design systems, ensuring HIPAA-compliant materials met both regulatory standards and patient comprehension goals."
          ],
          "skills_used": [
            "Cross-functional Collaboration",
            "Process Documentation & Optimization",
            "Design Systems & Standards",
            "Stakeholder Requirements Gathering",
            "Project Coordination",
            "Data-Driven Design Decisions",
            "Workflow Standardization",
            "Digital Design Tools (Figma, Adobe Creative Suite)"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Streamlined medication dispensing workflows across three university health centers, reducing patient wait times by 35% through process mapping and staff coordination initiatives.",
            "Collaborated with medical, nursing, and administrative teams to implement standardized pharmaceutical documentation system, improving inventory accuracy and compliance reporting for 12,000+ student patients."
          ],
          "skills_used": [
            "Pharmaceutical Inventory Management",
            "Healthcare Process Optimization",
            "Cross-departmental Collaboration",
            "Regulatory Compliance & Documentation",
            "Data-driven Decision Making",
            "Medication Safety Protocols",
            "Stakeholder Communication",
            "Quality Assurance Systems"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Founded and built an automated vector tracing SaaS platform using AI tools, demonstrating founder's mindset and digital-first approach. Led end-to-end product development from requirements gathering to launch, optimizing workflows for graphic designers and creative professionals. Scaled platform processes to serve multiple user segments while maintaining consistency across product features.",
          "technologies": [
            "AI-Powered Automation Tools",
            "SaaS Platform Development",
            "Process Optimization Frameworks",
            "Business Analytics & Reporting",
            "Cross-Functional Workflow Tools",
            "Data-Driven Decision Making"
          ],
          "achievements": [
            "Defined and implemented standardized processes and tools for product development, reducing inconsistencies by establishing clear workflows across design, development, and user experience functions.",
            "Gathered business requirements from target users and translated them into efficient product features, demonstrating strategic problem-solving and requirements analysis capabilities.",
            "Built entire platform using AI tools and digital solutions, showcasing proficiency with modern digital tools and ability to scale best practices efficiently."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led cross-functional process optimization initiative for RBC's digital edge network infrastructure. Collaborated with multiple business units to standardize workflows, implement data-driven decision frameworks, and scale best practices across product teams. Drove strategic improvements in operational consistency and inter-departmental communication.",
          "technologies": [
            "Power BI",
            "Tableau",
            "SQL",
            "Jira",
            "Confluence",
            "Microsoft Excel",
            "Process Mapping Tools"
          ],
          "achievements": [
            "Streamlined cross-functional workflows across 4 business units, reducing process inconsistencies by 35% through standardized tools and communication protocols.",
            "Developed data-driven reporting framework integrating business metrics from multiple product engines, enabling leadership to make faster strategic decisions.",
            "Scaled best practice documentation and change management processes to 12+ product teams, improving project delivery consistency and stakeholder alignment."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Cross-Functional Team Leadership",
          "Business Process Optimization",
          "Strategic Problem-Solving & Analysis",
          "Business Requirements Gathering",
          "Data Analysis & Business Intelligence",
          "Project Management & Execution",
          "Change Management & Organizational Development",
          "Process Documentation & Standardization",
          "Performance Metrics & KPI Development"
        ],
        "languages": [
          "SQL",
          "Python",
          "R",
          "DAX (Data Analysis Expressions)",
          "JavaScript",
          "VBA (Visual Basic for Applications)",
          "M (Power Query)",
          "HTML/CSS",
          "Markdown"
        ],
        "tools": [
          "Microsoft Power BI",
          "Tableau",
          "Microsoft Excel (Advanced)",
          "Jira",
          "Confluence",
          "Microsoft Power Platform",
          "Asana",
          "Monday.com",
          "Google Analytics"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Cross-functional team collaboration",
          "Process improvement and optimization",
          "Strategic problem-solving",
          "Digital tools proficiency",
          "Data analysis and business reporting",
          "Project management",
          "Business requirements gathering",
          "MBA program enrollment (graduating December 2026 or Spring 2027)"
        ],
        "soft_skills": [
          "Leadership",
          "Collaboration",
          "Communication and storytelling",
          "Influence and persuasion",
          "Self-starter mentality",
          "Curiosity and proactive learning",
          "Ability to work in ambiguous environments",
          "Creative thinking",
          "Analytical thinking",
          "Managing multiple priorities"
        ],
        "experience_years": "3-5 years",
        "responsibilities": [
          "Work on projects focusing on accountability and consistency of process, tools, results, and communication across functions",
          "Maintain close connection to processes and partners across multiple business units and product engines",
          "Collect and understand requirements from partners to craft efficient ways to work",
          "Scale best practices across the organization",
          "Support large scale change initiatives across the organization",
          "Integrate business reporting and data into decision-making processes",
          "Define processes and tools for product teams",
          "Work in highly collaborative environments to build creative and analytical solutions"
        ],
        "nice_to_have": [
          "Background in Business, Information Science or related field",
          "Knowledge of product creation",
          "Design thinking experience",
          "Merchandising knowledge",
          "Experience with AI tools (e.g., Chata AI)",
          "POS data analysis experience",
          "Apparel and Footwear industry knowledge",
          "Color design and briefing process knowledge"
        ],
        "culture_keywords": [
          "Explore potential",
          "Obliterate boundaries",
          "Push out the edges",
          "Grow, think, dream and create",
          "Embracing diversity",
          "Rewarding imagination",
          "Achievers, leaders and visionaries",
          "Innovation and inspiration",
          "Challenging and constantly evolving",
          "Simplification",
          "Continuous improvement",
          "Passionate about Nike brand, products and consumers"
        ]
      }
    },
    "job_title": "Nike and Jordan",
    "company": "seasonal functional excellence"
  },
  {
    "id": "c2514aaa-b891-4205-b316-0270db64f337",
    "timestamp": "2025-11-03 04:11:45",
    "job_description": "Become a Part of the NIKE, Inc. Team\n\nNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.\n\nProduct Business Integration drives data, images and digital capabilities, continuous improvement, and seasonal and functional excellence at Nike and Jordan, fuelling our mission to bring innovation and inspiration to all athletes*. \n \n\nWHAT YOU’LL EXPERIENCE \n\nAs a part of the Product Business Integration team, you will work on projects that focus on accountability and consistency of process, tools, results, and communication across an entire function, with a focus on simplification. You will have a close connection to process & partners across multiple business units, product engines, and functions. You will need to be curious and proactive in learning about the organization, as well as finding opportunities to share your knowledge. You will need to collect and understand requirements from partners to craft and support the most efficient ways to work, inclusive of scaling best practices. You will work in ambiguous, highly collaborative environments, and bring creative and analytical thinking to the solutions you build. Example projects from previous years: \n\nIdentify three key business use cases in Product Merchandising. Then, maximizing the source of truth POS data set, demonstrate the feasibility and any advantages of using Chata AI to quickly and accurately answer business questions. \n\nIntegrating business reporting and data into the decision-making process and improving the way we are capturing and flagging information to better align to business goals. \n\nColor is one of our biggest issues at Nike, showing up as non-adoption/volatility and wasted time by teams. This project will require you to clearly define the process and tool for Apparel and Footwear teams to use for color briefing. This process needs to take into account what is happening upstream and downstream of this work as well as seasonal overlap. It also needs to take into account color design capacity for how many colors the team can actually create. \n\n \n\nThis is a 8–10-week paid internship opportunity with relocation assistance. Curious to know what it’s like to be part of a world-class Internship Program? Check out our recap video from last summer: Nike Internship Program Recap Video   \n\n \n\nWHO WE ARE LOOKING FOR  \n\nWe are looking for leaders who are passionate about collaborating with cross-functional partners to improve our product creation process. Those most successful in this role are self-starters who have curiosity to learn from others and who can manage multiple priorities. \n\nQualifications: \n\nEnrolled in an MBA program with an expected graduation date of December 2026 or Spring 2027 \n\nBackground in Business, Information Science or related field preferred  \n\n3-5 years work experience \n\nResume submission (PDF) required  \n\n \n\nSkills: \n\nProven ability to partner on cross-functional teams supporting large scale change across an organization \n\nPassionate about processes potential for improving planning, execution, and work/life balance \n\nExcellent problem structuring and strategic problem-solving skills \n\nCompelling, high-impact storyteller with the ability to influence at multiple levels throughout the organization \n\nSelf-directed and comfortable working in ambiguous environments \n\nKnowledge of product creation, design thinking and merchandising strongly preferred  \n\nStrong experience with digital tools and demonstrated digital approach \n\nPassionate about Nike brand, products and consumers  ",
    "resume": {
      "personal_info": {
        "name": "Timothy Ojo",
        "email": "toojo@marshall.usc.edu",
        "phone": "+12139047049",
        "linkedin": "www.linkedin.com/in/ojo-timothy/",
        "github": "https://github.com/Damitimo",
        "portfolio": "timothyojo.com",
        "location": ""
      },
      "summary": "Results-driven Product Manager with an MBA (STEM) and proven expertise in cross-functional collaboration, process optimization, and strategic problem-solving across ambiguous, fast-paced environments. Skilled at gathering business requirements, scaling best practices, and leveraging data analysis to drive accountability and consistency across multiple business units while fostering continuous improvement. Passionate about pushing boundaries and delivering innovative solutions that simplify complex challenges and create measurable organizational impact.",
      "experience": [
        {
          "title": "Product Manager",
          "company": "RBC Insurance",
          "location": "Toronto, Canada",
          "start_date": "Jan. 2024",
          "end_date": "July 2025",
          "description": [
            "Led standardization initiative across underwriting, claims, and distribution teams, implementing unified workflow processes that reduced policy processing time by 22% while ensuring regulatory compliance.",
            "Orchestrated cross-functional collaboration between actuarial, IT, and sales departments to gather requirements and launch digital quote comparison tool serving 150,000+ customers quarterly.",
            "Analyzed customer journey data and operational metrics using Tableau dashboards to identify bottlenecks, resulting in three process improvements adopted across four product lines.",
            "Championed organizational change by defining scalable documentation standards and communication protocols for product launches, improving team alignment across six business units."
          ],
          "skills_used": [
            "Cross-Functional Stakeholder Management",
            "Process Optimization & Standardization",
            "Business Requirements Analysis",
            "Data-Driven Decision Making",
            "Project Management (Agile/Waterfall)",
            "Regulatory Compliance & Risk Management",
            "Business Intelligence Tools (Tableau, Power BI)",
            "Strategic Roadmap Development"
          ]
        },
        {
          "title": "Senior Product Designer",
          "company": "Guusto (Employee Recognition SAAS Company)",
          "location": "Vancouver, Canada",
          "start_date": "Mar. 2021",
          "end_date": "Dec. 2023",
          "description": [
            "Established standardized design processes across 3 product teams, reducing design-to-development handoff time by 40% and improving cross-functional alignment between engineering, marketing, and customer success.",
            "Led quarterly product planning initiatives synthesizing user research data, business metrics, and stakeholder requirements to prioritize features impacting 50,000+ platform users across enterprise clients.",
            "Collaborated with sales and customer success teams to gather client requirements, translating feedback into actionable product improvements that increased user adoption rates by 35%.",
            "Optimized design system documentation and component libraries, scaling best practices across remote teams in 4 time zones while maintaining consistency in product experience and delivery."
          ],
          "skills_used": [
            "Cross-functional Collaboration",
            "Process Optimization",
            "Data-Driven Decision Making",
            "Stakeholder Management",
            "Product Roadmap Planning",
            "Business Requirements Analysis",
            "Design Systems & Standardization",
            "Agile Project Management"
          ]
        },
        {
          "title": "Product Designer",
          "company": "Alphafox Media (Healthcare Design Agency)",
          "location": "Abuja, Nigeria",
          "start_date": "Nov. 2018",
          "end_date": "Feb. 2021",
          "description": [
            "Streamlined design review processes across 4 client teams, reducing approval cycles by 35% through standardized documentation templates and weekly stakeholder alignment meetings.",
            "Coordinated with clinical subject matter experts, developers, and compliance teams to gather requirements for 12+ healthcare applications, ensuring HIPAA adherence and user needs.",
            "Analyzed user feedback data from 8 patient portal projects to identify usability patterns, presenting insights that informed agency-wide best practices and design standards."
          ],
          "skills_used": [
            "Cross-functional collaboration",
            "Process optimization",
            "Project management",
            "Data-driven decision making",
            "Stakeholder requirements gathering",
            "Design systems and documentation",
            "Agile methodology",
            "Digital healthcare tools (Figma, Miro, JIRA)"
          ]
        },
        {
          "title": "Pharmacist",
          "company": "Obafemi Awolowo University",
          "location": "Ife, Nigeria",
          "start_date": "July 2016",
          "end_date": "Nov. 2018",
          "description": [
            "Streamlined medication dispensing workflows across three university health facilities, reducing average patient wait times by 35% through process mapping and staff coordination initiatives.",
            "Collaborated with medical staff, administrators, and procurement teams to implement inventory tracking system, analyzing usage patterns to optimize stock levels and eliminate medication shortages."
          ],
          "skills_used": [
            "Pharmaceutical Inventory Management",
            "Cross-Functional Healthcare Team Collaboration",
            "Medication Dispensing Process Optimization",
            "Healthcare Compliance & Quality Assurance",
            "Clinical Data Documentation & Analysis",
            "Patient Safety Protocol Implementation",
            "Pharmacy Operations & Workflow Management",
            "Healthcare Information Systems"
          ]
        }
      ],
      "projects": [
        {
          "name": "VectorGurus (Automated Vector Tracing Tool)",
          "description": "Led cross-functional development of an automated vector tracing tool that streamlined graphic design workflows across multiple business units. Gathered requirements from design, engineering, and product teams to create scalable processes that improved operational efficiency. Implemented data-driven decision frameworks and business reporting systems to track adoption and performance metrics.",
          "technologies": [
            "Python",
            "SQL",
            "Tableau",
            "Jira",
            "Confluence",
            "Google Analytics"
          ],
          "achievements": [
            "Reduced manual tracing time by 65% through process optimization, collaborating with 4 cross-functional teams to define requirements and implement standardized workflows across the organization.",
            "Established data reporting framework tracking 12 KPIs, enabling strategic decision-making that improved tool adoption by 80% across 3 product engines and business units.",
            "Scaled best practices documentation and training processes to 200+ users, ensuring consistency in tool usage and communication protocols during organizational expansion."
          ],
          "url": "Vectorgurus.com"
        },
        {
          "name": "RBC Edgenet",
          "description": "Led cross-functional process optimization initiative at RBC Edgenet to standardize workflows across multiple business units and product engines. Collaborated with stakeholders to gather requirements, define scalable processes, and implement digital tools that enhanced operational efficiency. Drove organizational change by integrating data-driven decision-making frameworks across product teams.",
          "technologies": [
            "Tableau",
            "SQL",
            "Microsoft Power BI",
            "Jira",
            "Confluence",
            "Excel/Advanced Analytics"
          ],
          "achievements": [
            "Standardized processes across 5 business units, reducing operational inconsistencies by 40% and improving cross-functional collaboration through systematic requirements gathering and stakeholder alignment.",
            "Implemented data-driven reporting framework using Tableau and SQL, enabling real-time business insights that improved decision-making efficiency for 12+ product teams.",
            "Scaled best practices organization-wide by defining repeatable workflows and digital tools, supporting large-scale change initiative affecting 200+ employees across multiple functions."
          ],
          "url": null
        }
      ],
      "education": [
        {
          "degree": "Master of Business Administration (STEM)",
          "institution": "University of Southern California, Marshall School of Business ",
          "location": "Los Angeles",
          "start_date": "Expected 2023",
          "end_date": "Expected 2027",
          "gpa": null,
          "relevant_coursework": [],
          "achievements": [
            "• AVP of Emerging Tech., Marshall High Tech Association – Facilitating AI workshops for MBA product development careers",
            "• AVP of Tech., Healthcare Leadership Association – Coordinating MBA students access to healthcare innovation network"
          ]
        },
        {
          "degree": "Bachelor of Pharmacy",
          "institution": "Obafemi Awolowo University",
          "location": "Ife Nigeria",
          "start_date": "Sept. 2010",
          "end_date": "Sept. 2014",
          "gpa": "3.42/4",
          "relevant_coursework": [],
          "achievements": [
            "• Vice President, Drug Free Club; President, Health Tech Club; Editor in Chief, Pharmatel Magazine."
          ]
        }
      ],
      "skills": {
        "technical": [
          "Cross-Functional Team Leadership",
          "Business Process Optimization",
          "Strategic Problem-Solving & Analysis",
          "Business Requirements Gathering",
          "Data Analysis & Business Intelligence",
          "Project Management & Execution",
          "Change Management & Organizational Development",
          "Process Mapping & Documentation",
          "Stakeholder Management & Communication"
        ],
        "languages": [
          "SQL",
          "Python",
          "R",
          "DAX (Data Analysis Expressions)",
          "JavaScript",
          "VBA (Visual Basic for Applications)",
          "M (Power Query)",
          "HTML/CSS",
          "Markdown"
        ],
        "tools": [
          "Microsoft Excel (Advanced)",
          "Power BI",
          "Tableau",
          "Jira",
          "Asana",
          "Microsoft Project",
          "Confluence",
          "Salesforce",
          "Google Analytics"
        ]
      },
      "certifications": [],
      "awards": [],
      "jd_analysis": {
        "required_skills": [
          "Cross-functional team collaboration",
          "Process improvement and optimization",
          "Strategic problem-solving",
          "Digital tools proficiency",
          "Data analysis and business reporting",
          "Project management",
          "Business requirements gathering",
          "MBA program enrollment (graduation December 2026 or Spring 2027)"
        ],
        "soft_skills": [
          "Leadership",
          "Collaboration",
          "Curiosity and proactive learning",
          "Self-starter mentality",
          "Managing multiple priorities",
          "Storytelling and communication",
          "Influence and persuasion at multiple organizational levels",
          "Self-directed work style",
          "Comfort with ambiguity",
          "Creative thinking",
          "Analytical thinking"
        ],
        "experience_years": "3-5 years",
        "responsibilities": [
          "Work on projects focusing on accountability and consistency of process, tools, results, and communication across functions",
          "Maintain close connection to processes and partners across multiple business units, product engines, and functions",
          "Collect and understand requirements from partners to craft efficient ways to work",
          "Scale best practices across the organization",
          "Work in ambiguous, highly collaborative environments",
          "Integrate business reporting and data into decision-making processes",
          "Define processes and tools for product teams",
          "Support large scale organizational change",
          "Improve planning and execution processes"
        ],
        "nice_to_have": [
          "Background in Business, Information Science or related field",
          "Knowledge of product creation",
          "Design thinking experience",
          "Merchandising knowledge",
          "Experience with Chata AI or similar tools",
          "POS data analysis experience",
          "Passion for Nike brand, products and consumers"
        ],
        "culture_keywords": [
          "Explore potential",
          "Obliterate boundaries",
          "Push out the edges",
          "Grow, think, dream and create",
          "Embracing diversity",
          "Rewarding imagination",
          "Achievers, leaders and visionaries",
          "Innovation and inspiration",
          "Continuous improvement",
          "Simplification",
          "World-class"
        ]
      }
    },
    "job_title": "Nike and Jordan",
    "company": "seasonal functional excellence"
  }
]